const data21 = {
    "keys":["v2111", "v2112", "v2121", "v2122", "v2131", "v2132", "v2141"],
    "labels" : ["주의산만/과잉행동", "적응이 어려움", "보상이 부족함", "요구", "기분", "수용", "평균"],
    "descs" : ["주의력 결핍/과잉행동장애 증상을 반영하는 자녀의 행동적 특성", 
                "사회적이거나 물리적 환경 변화에 적응하는 자녀의 능력", 
                "부모가 자녀와의 상호작용으로 긍정적인 경험을 하게 되는 정도", 
                "자녀가 요구하는 것에 대한 부모의 경험", 
                "자녀의 정서적 상태", 
                "부모의 기대에 부응하는 자녀 특성의 정도", 
                ""],
    "colors" : ["#F2A148", "#F2A148","#F2A148","#F2A148","#F2A148", "#F2A148", "#F2A148"]
}

const data22 = {
    "keys":["v2211", "v2212", "v2221", "v2222", "v2231", "v2232", "v2241", "v2242"],
    "labels" : ["유능감", "고립",  "건강", "양육파트너 관계", "역할제한", "우울", "애착", "평균"],
    "descs" :  ["부모 역할에 대한 능력감과 얼마나 편안하게 느끼고 있는지 정도", 
                "사회적 지지정도", 
                "전반적인 양육 스트레스에 영향을 미칠 수 있는 부모의 건강정도", 
                "양육파트너로부터 받는 정서적 및 물리적 지지에 대한 부모의 지각", 
                "부모 역할의 결과로 나타나는 자유의 제한 및 개인 정체성의 제약에 대한 지각", 
                "부모의 정서적인 상태", 
                "친밀도를 느끼는 정도 및 자녀의 요구를 잘 관찰하고 반응할 수 있는 능력",
                ""],
    "colors" : ["#F2A148", "#F2A148","#F2A148","#F2A148","#F2A148", "#F2A148", "#F2A148", "#F2A148"]
}

const data23 = {
    "keys":["v2311", "v2312", "v2321"],
    "labels" :  ["총 스트레스", "생활 스트레스", " 평균"],
    "descs" :   ["자녀영역 및 부모영역 스트레스 총합",  "부모가 현재 겪고 있는 부모·자녀관계 이외의 스트레스 양", ""],
    "colors" : ["#F2A148", "#F2A148","#F2A148"]
}

const data32 = [
    {"주도성" :[
        {"v3211":[
            "스스로 놀잇감을 선택한다.",
            "아이가 놀잇감을 스스로 선택하는 것은 아이의 주도성을 높여주는 것입니다. \
            평소에 아이가 스스로 놀잇감을 선택하지 않으려는 모습이 자주 나타나는지 점검해 주세요. \
            ☞ 아이가 자유롭게 놀잇감을 선택할 수 있도록 “~가 하고 싶은 놀이를 골라볼래?” 하고 물어봐 주세요. \
            이런 과정에서 아이는 스스로 원하는 것을 선택하고 의사 표현을 하면서 놀이를 이끌어갈 수 있는 주도성을 키울 수 있어요.",
            "아이가 스스로 놀잇감을 잘 선택하는 모습을 보이고 있어요. \
            이렇게 스스로 놀잇감을 선택하는 모습은 놀이를 스스로 이끌어 나가는 주도적인 행동을 하는 모습입니다. \
            ☞ “~가 놀잇감을 골랐구나”, “이걸 가지고 놀고 싶구나”라며 놀잇감을 스스로 선택한 모습을 칭찬해 주세요."
        ]}, 
        {"v3212":[
            "스스로 놀이를 전개한다.",
            "아이가 스스로 놀이를 전개할 수 있는 것은 스스로의 놀이를 주도할 수 있는 힘이 있는 모습입니다. \
             아이가 평소에 스스로 놀이를 주도하려 하지 않고 부모에게 의존하는 모습을 보이지 않는지 점검해 주세요. \
             ☞ 아이와 놀이를 할 때, 아이 스스로 놀이를 선택하고 이끌어 갈 수 있도록 잠깐 기다려 주세요. \
            아이가 시작한 놀이를 따라가며 행동을 읽어주고 반응해 주세요.",
            "아이가 스스로 자신의 놀이를 잘 이끌어 가면서 주도적인 행동을 보여주고 있네요. \
            ☞ 아이랑 역할놀이를 할 때는 “엄마가 어떻게 할까?”라고 물어보고, 아이가 원하는 대로 반응해 주시면 됩니다. \
            아이가 엄마 마음h대로 하라고 하면 엄마가 상황에 맞게 재미있게 반응해 주시면 아이가 이끄는 놀이 속에서 즐거운 시간을 보낼 수 있어요."
        ]}
    ]}, 
    {"함께 놀이하기" :[
        {"v3221":[
            "함께 놀자고 부모에게 요구한다.",
            "아이가 부모에게 함께 놀자고 강하게 요구하는 모습은 아이가 혼자 노는 게 어렵거나 엄마의 반응을 강하게 원하고 있는 것입니다. \
            아이가 혼자놀이를 어려워하거나, 엄마의 반응이 약하지 않은지, 아이가 놀이를 즐겁게 하고 있는지 살펴봐주세요. \
            ☞ 혼자놀이를 어려워하는 경우에는 모방할 수 있도록 엄마가 좀 더 적극적으로 놀이하면서 모델링이 되어주면 좋아요. \
            또한 아이들의 놀이에 함께 집중하셔서 아이가 기뻐할 때, “정말 신난다.”, 열심히 만들던 블록이 무너지면 “아이고, 속상하겠다.” 하면서 마음을 공감해 주세요.",
            "아이와 엄마가 즐겁게 놀이하는 모습을 보이고 있어요. 아동이 부모에게 함께 놀자고 강하게 요구하는 모습은 아이가 혼자 노는 게 어렵거나 엄마의 반응을 강하게 원하고 있는 것입니다. \
            ☞ 놀이에서 어떤 놀이를 할지 아이가 결정할 수 있도록 도와주고, 본래 놀이의 목적과 다른 방법으로 놀이하더라도, 선택을 존중해 주고 재미있게 반응해 주며 지금처럼 아이와 재미있게 놀이해 주세요."
        ]}, 
        {"v3222":[
            "놀이에 참여하려는 부모의 요구에 응한다.",
            "놀이에 잘 참여하려는 부모의 요구를 받아들이는 것은 부모의 요구를 수용하고, 함께 놀이하는 즐거움을 잘 느낀다는 것입니다. \
            아이가 부모와 함께 하는 놀이보다 자신의 관심 영역에서만 놀이를 하려고 하지는 않는지, 평소 부모의 놀이 경험이 부족하거나 함께 하는 놀이를 거부하지는 않는지 살펴 봐주세요. \
            ☞ 부모는 아이와의 놀이 시간을 일정하게 정해서 놀아주세요. 아이가 부모와의 놀이 시간에 즐거움을 경험한다면 함께하는 놀이의 즐거움을 느끼고, 부모와의 상호작용에서도 부모의 요구를 편안하게 수용할 수 있어요.",
            "놀이에 참여하려는 부모의 요구에 응하며 즐겁게 놀이하는 모습을 보이네요. \
            놀이에 잘 참여하려는 부모의 요구를 받아들이는 것은 부모의 요구를 수용하고, 함께 놀이하는 즐거움을 잘 느낀다는 것입니다. \
            ☞ 아이와의 함께 놀이를 하면서 서로가 좋아하는 색, 노래 등 정서교류를 충분히 한다면 좀 더 활발한 놀이 활동을 할 수 있어요."
        ]}, 
        {"v3223":[
            "놀잇감에 주의를 기울여 탐색하고 목적있게 다룬다.",
            "놀잇감의 주의를 기울여 탐색하고 목적 있게 다룬다는 것은 아이가 함께 하는 놀이에서 놀잇감에 대한 반응이 활발하다는 것입니다. \
            평소에 아이가 놀잇감에 대해 흥미를 가지고 활발하게 놀이하는 모습을 보이는지 점검해 보세요. \
            ☞ 아이의 놀이 발달 촉진을 도와주기 위해서 아이와 동일한 장난감을 가지고 다양하게 놀이해 볼 수 있습니다. \
            예를 들어, 아이가 자동차 굴리기만 한다면 자동차 경주, 미끄럼틀 위에서 차 굴리기 등 아이가 선택한 놀잇감을 가지고 다양하게 노는 방법을 제시해 주세요.",
            "놀잇감의 주의를 기울여 탐색하고 목적 있게 다루는 모습을 보이네요. \
            놀잇감의 주의를 기울여 탐색하고 목적 있게 다룬다는 것은 아이가 함께 하는 놀이에서 놀잇감에 대한 반응이 활발하다는 것입니다. \
            ☞ 아이가 놀잇감의 주의를 기울여 탐색하고 목적 있게 다룰 때 부모는 아이의 모습에 관심을 보이며 “우와 농구공이 골대에 들어갔구나 정말 신나겠다.”라고 말하며 긍정적으로 반응하여 아이가 더 흥미롭게 놀이할 수 있도록 해 주세요."
        ]}, 
        {"v3224":[
            "스스로 놀잇감을 바꾼다.", 
            "아이가 스스로 놀잇감을 바꾸는 모습은 아이가 함께하는 놀이에서 놀이를 잘 주도해 나갈 수 있다는 것입니다. \
            아이가 스스로 장난감을 바꾸며 놀이를 주도해 나가지 못하고 부모에게만 의존하고 있는 건 아닌지 살펴봐 주세요. \
            ☞ 아이가 지금의 놀이가 재미없어 보이는 대도 다른 놀잇감으로 바꾸지 못한다면, 부모가 “여기에 이거도 있네.”라며 새로운 놀잇감을 제안해 주어도 좋습니다. \
            하지만 아이의 기존 놀이가 끝나지 않고 잘 이어져 나간다면 계속 같은 놀이를 하는 것은 괜찮아요.", 
            "아이가 스스로 놀잇감을 바꾸며 놀이를 주도해 나가는 모습을 보입니다. \
            아이가 스스로 놀잇감을 바꾸는 모습은 아이가 함께하는 놀이에서 놀이를 잘 주도해 나갈 수 있다는 것입니다. \
            ☞ 아이가 놀잇감을 바꾸는 모습을 보일 때, 그대로 따라가면서 부모의 놀이도 바뀐 놀이로 전환하여 또다시 아이와 함께 놀아 주시면 돼요."
        ]}, 
        {"v3225":[
            "부모의 반영에 고무되어 놀이가 활발하다.",
            "아이가 스스로 놀잇감을 바꾸는 모습은 아이가 함께하는 놀이에서 놀이를 잘 주도해 나갈 수 있다는 것입니다. \
            아이가 스스로 장난감을 바꾸며 놀이를 주도해 나가지 못하고 부모에게만 의존하고 있는 건 아닌지 살펴봐 주세요. \
            ☞ 아이가 지금의 놀이가 재미없어 보이는 대도 다른 놀잇감으로 바꾸지 못한다면, 부모가 “여기에 이거도 있네.”라며 새로운 놀잇감을 제안해 주어도 좋습니다. \
            하지만 아이의 기존 놀이가 끝나지 않고 잘 이어져 나간다면 계속 같은 놀이를 하는 것은 괜찮아요. ",
            "아이가 스스로 놀잇감을 바꾸며 놀이를 주도해 나가는 모습을 보입니다. \
            아이가 스스로 놀잇감을 바꾸는 모습은 아이가 함께하는 놀이에서 놀이를 잘 주도해 나갈 수 있다는 것입니다. \
            ☞ 아이가 놀잇감을 바꾸는 모습을 보일 때, 그대로 따라가면서 부모의 놀이도 바뀐 놀이로 전환하여 또다시 아이와 함께 놀아 주시면 돼요."
        ]}, 
        {"v3226":[
            "부모의 놀이제안에 아동은 의사표현을 하며 놀이상황에 따라 감정표현이 알맞다.",
            "놀이 제안에 아이가 분명하게 의사 표현을 하고 놀이 상황에 따라 감정 표현을 표현하는 것은 아이가 부모와의 놀이에서 자신의 의사전달과 감정 표현을 잘하고 있다는 것입니다. \
            아이가 평소에 자신의 의사 표현이나 감정 표현을 잘하고 있는지 살펴봐주세요. \
            ☞ 놀이를 할 때 “어떤 놀이를 할까?”, “어떻게 하고 싶어?”라고 의사를 물어보거나, “속상하겠다.” “기분이 좋구나” 같이 감정을 읽어주세요. \
            아이는 놀이 속에서 자신의 의사를 표현하는 방법, 감정을 표현하는 방법을 연습해 나갈 수 있어요.",
            "아이는 부모와의 놀이에서 자신의 의사 표현이나 감정 표현을 알맞게 하는 모습을 보입니다. \
            놀이 제안에 아동은 분명하게 의사 표현을 하고 놀이 상황에 따라 감정 표현을 표현하는 것은 아동이 부모와의 놀이에서 자신의 의사전달과 감정 표현을 잘하고 있다는 것입니다. \
            ☞ 아이가 자신의 의사 표현을 할 때 “너의 생각은 그렇구나” 하고 아이의 의견을 존중해 주고 아이가 자신의 감정을 나타낼 때에는 “많이 속상 했구나”라고 이야기해 주며 공감하는 모습을 보여 주세요."
        ]}
    ]}, 
    {"정서적 유대" :[
        {"v3231":[
            "부모의 얼굴을 응시한다.",
            "부모의 얼굴을 응시하는 것은 부모와 정서적 유대감을 잘 형성되었다는 것입니다. \
            부모는 아이와 신뢰하는 관계를 형성하고 정서적 교감이 잘 이루어지고 있는지 점검해 보세요. \
            ☞ 평소에 아이가 관심 있는 놀이나 흥미로워하는 것을 가지고 함께 놀이해주세요. \
            아이가 공을 굴리고 있다면 공에 관심을 보이며 함께 공을 주고받는 즐거움을 공유한다면 부모를 바라보며 정서적 유대감을 형성할 수 있어요.",
            "부모의 얼굴을 잘 응시하는 모습을 보입니다. \
            부모의 얼굴을 응시하는 것은 부모와 정서적 유대감을 잘 형성되었다는 것입니다. \
            ☞ 아이가 부모의 얼굴을 잘 응시할 때, 엄마가 방긋 웃어주면서 긍정적인 반응을 보이면 아이는 눈빛만으로도 엄마가 정서적 유대감을 느낄 수 있을 거예요."
        ]}, 
        {"v3232":[
            "부모의 시선이 가는 곳을 따라간다.",
            "부모의 시선이 가는 곳을 따라가는 것은 아동이 부모와 같은 곳을 바라보면서 함께 놀이에 몰입하고 있는 것입니다. \
            아이가 자신의 장난감을 보여주거나 부모의 행동에 관심이 없고 부모와 다른 관심을 가지고 있지 않는지 살펴봐 주세요. \
            ☞ 아이가 다른 곳을 바라본다면 부모가 아이의 시선을 따라가며 “00를 보고 있구나” 하고 아이가 관심을 가지고 있는 곳을 바라보고, 부모와 함께하는 놀이를 즐거워할 수 있도록 해주세요. ",
            "부모의 시선이 가는 곳을 따라가고 있네요. \
            부모의 시선이 가는 곳을 따라가는 것은 아동이 부모와 같은 곳을 바라보면서 함께 놀이에 몰입하고 있는 것입니다. \
            ☞ 아이가 부모의 시선을 따라가며 외부대상을 부모와 함께 바라보고 관심을 보일 때 ‘해바라기 꽃이 폈구나 엄청 예쁘다’라고 이야기하며 친밀한 상호작용을 해 주세요. \
            부모와 아이가 함께 관심을 공유하며 친밀한 상호작용이 이루어지면 아이는 정서적 안정감을 가지고 성장할 수 있어요. "
        ]}, 
        {"v3233":[
            "부모와의 눈 맞춤이 자연스럽다.",
            "부모와의 눈 맞춤이 자연스럽다는 것은 아이와 부모가 따뜻하고 친밀한 관계가 형성되었다는 것입니다. \
            평소에 아이와의 관계가 친밀하고 가까운지 점검해 보세요. \
            ☞ 숨바꼭질, 이불 그네 태우기 등 자연스러운 눈 맞춤이 이루어질 수 있는 흥미로운 놀이를 해 보세요. \
            즐거운 놀이를 통해 자연스러운 눈 맞춤이 이루어지고 아이와 친밀한 관계를 형성해 나갈 수 있어요.",
            "아이와 자연스러운 눈 맞춤이 이루어지고 있네요. \
            자연스러운 눈 맞춤이 이루어지는 모습은 아이와 부모가 따뜻하고 친밀한 관계가 형성되었다는 것입니다. \
            ☞ 아이가 부모와 눈을 마주칠 때, 미소를 보이는 등 정서 교감을 하기도 하고, “~이 눈이 반짝반짝 빛나네” 라고 말하며 긍정적인 상호작용도 해보세요."
        ]}, 
        {"v3234":[
            "부모에게 긍정적인 신체적 접촉을 시도한다.",
            "부모에게 긍정적인 신체적 접촉을 시도한다는 것은 아이가 신체적으로도 부모에게 정서적 안정감을 느끼며 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            아이가 부모와의 관계에서 자연스러운 신체 접촉을 하며 친밀감을 느끼고 있는지 점검해 주세요. \
            ☞ 아이와 눈을 마주치며 대화를 하고, 머리를 쓰다듬어 주고, 자주 안아주고, 부드럽게 로션을 발라주는 등 긍정적인 신체적 접촉을 통해 아이가 부모와 정서 교감을 하고, 사랑받는 존재라고 느낄 수 있도록 해 주세요.",
            "부모에게 긍정적인 신체적 접촉을 시도하네요. \
            부모에게 긍정적인 신체적 접촉을 시도한다는 것은 아이가 신체적으로도 부모에게 정서적 안정감을 느끼며 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            ☞ 아이가 신체적 접촉을 시도할 때 부모가 하이파이브, 안아주기 등 신체적 접촉을 해주면서 긍정적인 상호작용이 오랫동안 유지될 수 있게 해 주세요. "
        ]}, 
        {"v3235":[
            "부모의 신체적 접촉을 수용한다.",
            "아이가 부모의 신체적 접촉을 수용하는 것은 신체 접촉을 통한 부모와의 정서적 유대감이 편안하게 이루어지고 있다는 것입니다. \
            평소에 부모와의 신체적 접촉이 부족하거나, 아이의 스킨십이나 옷 레벨 등 감각자극에 예민하지는 않는지 살펴보세요. \
            ☞ 자연스럽게 아이를 안아주거나 쓰다듬어주면서 신체 접촉에 편안함을 느낄 수 있게 해주세요. \
            아이가 신체 접촉에 예민한 반응을 보인다면 아이가 편안하게 느끼는 자극부터 받아들이면서 조금씩 수용할 수 있도록 해주세요.",
            "아이가 부모의 신체적 접촉을 수용하고 있네요. \
            부모의 신체적 접촉을 수용한다는 것은 신체 접촉을 통한 부모와의 정서적 유대감이 편안하게 이루어지고 있다는 것입니다. \
            ☞ 아이와 놀이를 할 때 놀이 사이사이에 부모의 사랑과 관심이 느껴지도록 하이파이브를 하거나 머리를 쓰다듬어주며 아이의 행동에 칭찬과 격려를 아낌없이 해주세요."
        ]}, 
        {"v3236":[
            "부모의 지원에 긍정적으로 반응한다.",
            "부모의 언어적 지원에 긍정적으로 반응한다는 것은 언어적으로 부모와 잘 교감하면서 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            평소에 부모의 언어적 지원에 듣지 않으려고 하거나, 반응하지 않는 등 부정적 반응이 나타나지는 않는지 살펴봐주세요. \
            ☞ 아이가 좋아하는 놀이나 흥미를 보이는 것을 가지고 언어적으로 이야기해 보세요. \
            또 부모의 감정이나 생각을 먼저 이야기하면서 아이가 언어자극을 좀 더 편안하게 받아들일 수 있도록 해주세요.",
            "부모의 언어적 지원에 긍정적으로 반응하고 있네요. \
            부모의 언어적 지원에 긍정적으로 반응한다는 것은 언어적으로 부모와 잘 교감하면서 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            ☞ 아이가 부모의 언어적 지원을 잘 수용하고 받아들일 때 때로는 “엄마 이야기를 잘 듣고 있구나.”라며 아이가 보이는 반응에 대해 칭찬과 지지를 해주세요."
        ]}
    ]}, 
    {"즐거움 공유" :[
        {"v3241":[
            "활동에 따라 움직임의 수준을 조절한다.",
            "활동에 따라 움직임의 수준을 조절한다는 것은 대· 소근육 발달이 잘 이루어지고 있는 것입니다. \
            아이가 대근육과 소근육의 움직임이 서툴지 않은지 점검해 주세요. \
            ☞ 부모는 아이와 씨름, 공놀이 등 대근육 활동과 종이접기, 색칠공부 등의 소근육 활동을 통해 다양한 신체적 움직임을 경험하고, 조절하는 것을 연습해 나갈 수 있도록 해 주세요.",
            "아이가 활동에 따라 움직임의 수준을 잘 조절하고 있네요. \
            활동에 따라 움직임의 수준을 조절한다는 것은 대· 소근육 발달이 잘 이루어지고 자신의 신체를 잘 조절할 수 있다는 것입니다. \
            ☞ 아이와 “즐겁게 춤을 추면서 그대로 멈춰라!”, “눈을 깜빡이면 점프하기” 등의 신체활동을 해주세요. \
            이를 통해 간단한 규칙을 익히고, 자신의 몸을 조절하는 능력도 키울 수 있어요."
        ]}, 
        {"v3242":[
            "긍정적인 표정이 나타난다.",
            "아이의 긍정적인 표정은 아이가 현재 부모와의 놀이를 즐거워하고 있다는 것입니다. \
            아이의 표정 속에서 놀이에 대한 즐거움과 만족감이 충분히 나타나는지 점검해 주세요. \
            ☞ 아이와 부모가 놀이하면서 함께 즐겁게 느낀다면 아이의 표정도 달라질 거예요. \
            아이의 놀이에 집중하면서 “어떤 놀이를 할까?”, “~랑 노니까 엄마도 재미있다.”라고 반응해 주세요. \
            아이가 흥미를 보이지 않으면 살짝 부모님이 놀이를 제안해서 즐거운 놀이가 될 수 있도록 해주시는 것도 좋아요.",
            "아이가 놀이 속에서 긍정적인 표정을 보이네요. \
            긍정적인 표정이 나타난다는 것은 아이가 부모와의 놀이 속에서 즐거움과 만족감을 충분히 느끼고 있다는 것입니다. \
            ☞ 아이와 놀이할 때는 평소보다 목소리 크게 한다거나, 감탄사를 넣어주면서 부모님도 아이와 함께 재미있는 시간을 보내신다면 아이는 놀이에 더욱 흥미를 느낄 수 있어요."
        ]}, 
        {"v3243":[
            "놀이의 즐거움에 대해 언어적으로 표현한다.",
            "놀이의 즐거움이 언어적으로 표현된다는 것은 놀이에서 의사소통이 잘 이루어지고 타인과 놀이의 즐거움을 공유한다는 것입니다. \
            평소에 아이가 놀이를 하면서 자신의 의사와 즐거움을 언어적으로 표현하는지 점검해 보세요. \
            ☞ 부모는 아이와 놀이를 하면서 즐거움을 언어로 표현해 주며 모델링이 되어 주세요. \
            예를 들어 “우와! 냉장고에서 얼음도 나오네. 정말 재미있다”라고 이야기해 주시면 좋아요.",
            "놀이의 즐거움을 언어적으로 잘 표현하고 있네요. \
            놀이의 즐거움이 언어적으로 표현된다는 것은 놀이에서 의사소통이 잘 이루어지고 타인과 즐거움을 공유한다는 것입니다. \
            ☞ 놀이를 하면서 아이가 즐거움을 표현할 때 아이의 이름을 말하며 “엄마도 ~와 함께 노니까 너무 재미있다.”라며 긍정적으로 반응을 해주세요. "
        ]}, 
        {"v3244":[
            "놀이의 즐거움에 대해 동작으로 표현한다.",
            "놀이의 즐거움이 동작으로 표현된다는 것은 놀이를 하면서 상호작용이 잘 이루어지고 타인과 즐거움을 공유한다는 것입니다. \
            아이와 놀이를 할 때 상호작용이 잘 되고 있는지 점검해 주세요. \
            ☞ 아이와 놀이를 하면서 아이를 보며 즐거운 표정을 짓거나 손뼉 쳐주기, 하이파이브 하기 등놀이에 대한 즐거움을 동작으로 표현하며 아이에게 모델링이 될 수 있도록 해주세요. ",
            "놀이의 즐거움에 대해 동작으로 잘 표현하고 있네요. \
            놀이의 즐거움이 동작으로 표현된다는 것은 놀이하면서 상호작용이 잘 이루어지고 타인과 즐거움을 공유한다는 것입니다. \
            ☞아이가 즐거움을 동작으로 표현할 때 아이가 느끼는 감정에 대해 말해 주세요. \
            예를 들어“퍼즐을 완성하고 웃는 걸 보니 엄청 뿌듯하구나.”라고 말하며 아이가 느끼는 감정에 대해 말해주면 아이는 자기의 행동을 감정과 연결시킬 수 있게 되고 자기감정에 대한 인식도 늘어날 수 있어요. "
        ]}]}, 
    {"정서조절" :[
        {"v3251":[
            "해야 하는 것은 싫어도 한다.",
            "해야 하는 것을 하기 싫어도 하는 것은 자기조절 능력이 잘 발달하고 있는 것입니다. \
            평소에 아이가 스스로의 감정이나 행동을 조절할 수 있는지, 또 부모가 아이에게 허용되는 것과 허용되지 않는 것에 대한 경계가 확실한지 점검해 주세요. \
            ☞ 부모가 아이에게 규칙을 적용할 때에는 화를 내지 않고 규칙을 알려줘야 합니다. \
            예를 들어 장난감을 정리하지 않을 때 장난감을 정리하지 않으면 물건을 잃어버리거나, 다 칠 수 있다고 설명해 주시고 처음부터 장난감 전체를 정리하게 하기보다는 2/3는 부모가 정리해 주고 1/3정만 남겨서 아이에게 정리하라고 해주세요 그 이후 조금씩 양을 늘려 나가며 정리 습관을 익힐 수 있게 도와줍니다. \
            이렇게 긍정적인 방법으로 아이가 규칙을 지켜볼 수 있도록 합니다. \
            아이가 처음에는 규칙을 잘 따르려고 하지 않아도 지속적으로 설명하면서 아이가 인내하며 할 수 있도록 지지해 주세요.",
            "아이는 해야 할 일을 위해 자신의 감정을 잘 조절하면서 해내는 모습을 보이네요. \
            해야 하는 것을 하기 싫어도 하는 것은 인내심이 있고, 자기조절 능력이 잘 발달하고 있다는 것입니다. \
            ☞ 하기 싫지만 해야 할 일을 잘 해내는 모습을 보일 때는 “00 이는 양치질하기 싫어도 이를 꼼꼼하게 닦았구나. 자기 할 일을 하려고 노력하는 모습이 정말 멋있어”라고 이야기하면서 구체적인 칭찬과 격려를 아낌없이 해 주세요."
        ]}, 
        {"v3252":[
            "기분이 나빠져도 화풀이를 행동으로 하지 않는다.",
            "기분이 나빠져도 화풀이하는 행동을 하지 않는 것은 자신의 감정을 잘 조절할 수 있다는 것입니다. \
            아이가 평소에 화가 나거나 속상할 때, 감정 조절이 어렵고 공격적으로 행동하거나 감정을 적절하게 표현하지 못하는 모습을 보이는지 점검해 주세요. \
            ☞ 아이가 기분이 나빠져 화풀이 행동을 할 때 “~ 때문에 속상했구나”라며 아이의 마음을 먼저 이해해 주세요. \
            아이의 마음을 이해해 주면 아이는 자신의 감정을 수용 받으면서 움켜쥐려고 했던 마음을 조금씩 내려놓게 됩니다. \
            그다음은 아이의 화나는 감정은 인정하지만 안 되는 행동에 대해서는 합리적으로 설명을 해주어야 합니다. \
            이런 경험을 반복하게 되면 아이는 스스로 감정을 이해받으면서 자기의 행동을 조절하는 모습이 나타날 것입니다.",
            "아이가 기분이 나빠져도 화풀이하는 행동을 하지 않는 모습을 보이네요. \
            기분이 나빠져도 화풀이하는 행동을 하지 않는 것은 자기감정을 잘 조절할 수 있다는 것입니다. \
            ☞ 아이가 기분이 나빠졌을 때 화풀이 행동을 하지 않고 자신의 부정적 감정을 말로 표현한다면 부모는 “속상한 감정을 말로 잘 이야기해 줬구나. 이렇게 이야기해주니 너의 마음을 잘 알 수 있을 것 같아”라고 이야기하면서 아이의 말을 따뜻하게 수용하고 경청해 주세요."
        ]}, 
        {"v3253":[
            "화가 났을 때 말로 문제를 해결 한다.",
            "화가 났을 때 말로 문제를 해결한다는 것은 타인과의 관계에서 정서조절 능력이 잘 발달하고 있다는 것입니다. \
            아이가 화가 났을 때는 그 감정을 행동보다는 말로 표현하도록 도와주어야 합니다. \
            아이들은 아직 감정 표현이 미숙하기 때문에 화나는 감정을 울거나, 물건을 집어던지거나 누군가에게 공격적인 모습으로 나타내기도 합니다. \
            이러한 감정을 공격적인 행동이 아닌 말로 전달하는 연습이 필요합니다. \
            ☞ 부모는 평소에 이러한 부정적 감정을 말로 표현하고 설명해 주세요. \
            아이는 부모로부터 자신의 감정을 이해받고 부정적 감정을 언어로 전달하는 방법을 배울 수 있습니다.",
            "아이가 기분이 나빠져도 화풀이하는 행동을 하지 않는 모습을 보이네요. \
            기분이 나빠져도 화풀이하는 행동을 하지 않는 것은 타인과의 관계에서 정서조절 능력이 잘 발달해 나가고 있다는 것입니다. \
            ☞ 아이가 기분이 나빠졌을 때 화풀이 행동을 하지 않고 자신의 부정적 감정을 말로 표현한다면 부모는 “속상한 마음을 말로 이야기해 줘서 엄마가 너의 마음을 잘 알 수 있을 거 같아.”라고 이야기해 주고, 때로는 속상한 상황에 대해 부모가 도와줘야 할 것은 없는지 살펴봐주세요."
        ]}, 
        {"v3254":[
            "부모의 말에 동의를 한다.",
            "부모의 말의 동의를 한다는 것은 부모와의 관계에서 정서조절 능력이 잘 발달되고 있다는 것입니다. \
            아이가 평소에 부모의 말에 귀 기울이고 동의하는 모습은 어떤지 점검해 주세요. \
            ☞ 아이가 부모의 말에 동의하지 않고 고집을 부릴 때는 아이의 진짜 마음을 찾아 읽어주세요. \
            예를 들어 비가 와서 나갈 수 없다고 할 때, 나가겠다고 떼를 부리면, ‘~가 밖에 나가서 놀고 싶구나. 놀이터에서 놀면 재미있지’라고 아이의 마음을 읽어준 후, 놀이하고 싶은 아이의 마음을 따라 “우리 대신 집에서 물놀이할까?”라고 만족할 수 있는 대안을 제시해 주세요. \
            아이와 부모가 모두 만족할 수 있는 상황을 만들어 나가면서 아이는 부모의 말에 동의하고 자신의 마음을 조절할 수 있는 능력을 키울 수 있어요. ",
            "부모의 말에 귀 기울이고 잘 동의를 하네요. \
            부모의 말의 동의를 한다는 것은 부모와의 관계에서 정서조절 능력이 잘 발달되고 있다는 것입니다. \
            ☞ 아이가 엄마의 의견에 동의하는 모습을 보일 때 “엄마 이야기 잘 들어줘서 고마워”라며 고마움을 표현하면서 아이와 정서 교감을 해보세요."
        ]}
    ]}
];

const data33 = [
    {"주도성" :[
        {"v3311":[
            "아동이 놀잇감을 선택하도록 기회를 제공한다.",
            "아이가 놀잇감을 스스로 선택하도록 기회를 제공하는 것은 아이의 주도성을 높여주는 것입니다. \
            놀이를 할 때 부모가 먼저 놀잇감을 선택하고 주도해 나가지 않는지 점검해 주세요. \
            ☞ 아이가 자유롭게 놀잇감을 선택할 수 있도록 “무슨 놀이하고 싶어?”, “~가 하고 싶은 놀이 골라보자”하고 물어봐주세요. \
            이런 과정에서 아이가 자연스럽게 자신의 의사표현을 할 수 있고, 주도성을 키울 수 있습니다.",
            "아이가 스스로 놀잇감을 선택할 수 있도록 기회를 제공하고 있네요. \
            이렇게 스스로 놀잇감을 선택하는 모습은 놀이를 스스로 이끌어 나가는 주도적인 행동입니다. \
            ☞ “이 놀잇감을 골랐구나”, “~가 이걸 가지고 놀고 싶구나”하며 자신이 원하는 놀잇감을 스스로 선택할 수 있는 모습을 칭찬해 주세요."
        ]}, 
        {"v3312":[
            "놀이가 전개되도록 돕는다.",
            "아이가 스스로 놀이를 전개할 수 있도록 돕는 것은 아이 스스로 놀이를 주도해 나갈 수 힘을 기르게 해주는 것입니다. \
            아이가 놀이를 이끌어나가지 못하고 부모에게 의존하지 않는지 점검해 주세요. \
            ☞ 아이와 놀이를 할 때, 자신의 의견을 이야기하거나 행동할 때까지 잠깐 기다려 주세요. \
            또 놀이 상황이 말이 안 되는 상황이어도 위험하지 않으면 아이의 놀이를 존중하며 따라가 주세요.",
            "아이가 스스로 자신의 놀이를 잘 이끌어 가면서 주도적인 행동을 보여주고 있네요. \
            아이가 스스로 놀이를 전개할 수 있도록 돕는 것은 아이 스스로 놀이를 주도해 나갈 수 힘을 기르게 해주는 것입니다. \
            ☞ 아이랑 놀이를 할 때, “엄마는 어떻게 할까?”하며 놀이 속에서 어떻게 하면 좋을지 아이에게 물어보고, 아이가 주도하는 놀이에 즐겁게 반응해 주세요."
        ]}
    ]}, 
    {"함께 놀이하기" :[
        {"v3321":[
            "함께 놀자는 아동의 요구에 응한다.",
            "함께 놀자는 아이의 요구에 응한다는 것은 아이와 따뜻하고 친밀한 관계를 형성하며 놀이의 즐거움을 함께 공유하고 있다는 것입니다. \
            평소에 아이의 요구에 응하지 않고 귀찮아하거나 너무 바쁘게 지나치지는 않는지 점검해 주세요. \
            ☞ 아이가 달려와서 안기거나 혼자 놀다 지루해져 구조를 요청하듯 놀아달라고 할 때, “엄마랑 놀고 싶구나”, “이걸 가지고 함께 놀이하면 너무 재미있겠다.”라며 아이가 초대한 놀이에 반갑게 응해주면 아이는 함께 놀이를 통해 자신의 욕구를 부모와 정서적으로 교감할 수 있습니다. ",
            "아이가 함께 놀자는 요구에 잘 응해주고 있네요. \
            함께 놀자는 아이의 요구에 응한다는 것은 아이와 따뜻하고 친밀한 관계를 형성하고 놀이의 즐거움을 함께 공유하고 있다는 것입니다. \
            ☞ 아이와 놀이할 때 아이가 제시한 의견에 “좋은 생각인데~”, “00이가 말한 방법으로 놀이하니깐 더 재밌다.”라고 이야기해 주면 아이는 부모와의 놀이에서 더 신나고 즐거움을 느낄 수 있어요."
        ]}, 
        {"v3322":[
            "함께 놀자고 아동에게 요구한다.",
            "함께 놀자고 아이에게 요구하는 것은 아이와 따뜻하고 친밀한 관계를 형성하고 함께하는 놀이의 즐거움을 느끼기를 원한다는 것입니다. \
            평소에 아이에게 함께 노는 모습이 적거나 아이와의 놀이에서 즐거움을 느끼지 못하는지 않는지 점검해 주세요. \
            ☞ 아이에게 “엄마랑 같이 놀까?”, “무슨 놀이하고 싶어?” 하며 아이와 함께 놀고 싶은 마음을 표현해 보세요. \
            부모가 먼저 다가가 놀자고 이야기할 때, 아이는 부모의 따뜻한 관심과 사랑을 느낄 수 있습니다.",
            "함께 놀자고 아이에게 요구하는 모습을 보이네요. \
            함께 놀자고 아이에게 요구한다는 것은 아이와 따뜻하고 친밀한 관계를 형성하고 함께하는 놀이의 즐거움을 느끼기를 원한다는 것입니다. \
            ☞ 아이에게 함께 놀자고 요구할 때, 아이가 제안을 긍정적으로 받아드리면 “~이랑 노는 건 너무 즐거워”라며 부모도 아이와의 놀이가 즐겁다는 마음을 표현해주세요. "
        ]}, 
        {"v3323":[
            "아동이 선택한 놀잇감에 대해 관심을 나타낸다.",
            "아이가 선택한 놀잇감에 관심을 나타내는 것은 아이와 함께 하는 놀이에 대한 즐거움을 함께 한다는 것입니다. \
            평소에 아이의 놀이에 관심이 없거나 아이와 함께 놀이 시간이 부족한 건 아닌지 점검해 주세요. \
            ☞ 아이가 평소에 어떤 놀잇감을 좋아하는지 관심을 가지고 아이가 그 장난감을 꺼냈을 때, “우리 ~이가 (공룡)을 좋아하지”라며 미소를 지으며 아이가 좋아하는 것을 함께 바라보고 놀아주세요. \
            아이는 자기가 좋아하는 놀잇감을 알아주는 부모와 더욱 즐거운 놀이 시간을 보낼 수 있습니다.",
            "부모는 아이가 선택한 놀잇감에 관심을 나타내고 있네요. \
            아이가 선택한 놀잇감에 관심을 나타내는 것은 아이와 놀이에 대한 즐거움을 함께 한다는 것입니다. \
            ☞ 아이가 평소에 관심을 보이는 놀잇감에 대해 이야기를 나눈다면, 아이와 놀이 시간이 아니어도 아이와 대화하고 정서 교감을 할 수 있는 시간들이 될 것입니다. "
        ]}, 
        {"v3324":[
            "놀잇감을 바꾸는 아동의 행동에 긍정적으로 반응한다.",
            "놀잇감을 바꾸려는 아동의 행동에 긍정적으로 반응하는 것은 아이와 함께 하는 놀이에서 자연스럽게 아동을 따라가며 놀이해 주는 모습입니다. \
            아이가 놀이에서 다른 놀이로 전환하려고 할 때, 엄마가 하던 것을 계속 마무리하려고 하거나, 방해하지는 않는지 점검해 주세요. \
            ☞ 아이가 놀잇감을 바꾸려고 할 때, “이 놀이 그만하고 싶구나.”, “이번엔 블록을 가지고 놀고 싶구나”라며 놀잇감을 바꾸려는 아이의 마음과 행동을 읽어주고 긍정적인 반응해 주세요. ",
            "놀잇감을 바꾸려는 아동의 행동에 긍정적으로 반응하고 있네요. \
            놀잇감을 바꾸려는 아동의 행동에 긍정적으로 반응하는 것은 아이와 함께 하는 놀이에서 자연스럽게 아동을 따라가며 놀이해 주는 모습입니다. \
            ☞ 아이가 놀잇감을 바꾸려는 모습을 보일 때, “이제는 이걸 하고 싶구나.”, “그 놀이도 같이 해보면 재미있겠다.”라며 바꾼 놀잇감에 대한 관심을 보이며 아이의 놀이를 따라가주세요."
        ]}, 
        {"v3325":[
            "아이가 놀이에 몰입하도록 언어적/비언어적으로 반응한다.",
            "아이가 놀이에 몰입하도록 언어적/비언어적으로 반영해 주는 것은 아이의 상호작용 능력을 키워주는 것입니다. \
            평소에 아이와의 놀이에서 상호작용이 잘 이루어지고 있는지 확인해 주세요. \
            ☞ 아동의 놀이에 함께 할 때는 아이의 행동을 언어나 비언어적으로 읽어주시면 좋습니다. \
            예를 들어, 아이가 자동차를 가지고 바닥에서 굴리고 있다면 “삐뽀 삐뽀 소방차가 앞으로 지나가네”라고 이야기하며 아이의 놀이를 함께 따라가주시면 아이는 부모가 놀이에 함께 한다는 느낌을 받고 더욱 즐겁게 놀이에 몰입할 수 있습니다.",
            "아이가 놀이에 몰입하도록 언어적/비언어적으로 잘 반영해 주고 있네요. \
            아이가 놀이에 몰입하도록 언어적/비언어적으로 반영해 주는 것은 아이의 상호작용 능력을 키워주는 것입니다. \
            ☞ 아이가 놀이를 하면서 “소방관이 하늘을 날아서 불을 끄러 갑니다”라고 이야기하며 상상 놀이를 한다면, “우와! 하늘을 날아가는 소방관이구나. \
            정말 멋지다!”라고 함께 상상 속으로 들어가 반응해 주면 아이는 더욱 즐겁게 놀이에 몰입할 수 있습니다."
        ]}, 
        {"v3326":[
            "아동 놀이를 돕거나 확장하기 위해 지시적이지 않은 제안을 한다.",
            "아동의 놀이를 돕거나 확장하기 위해 지시적이지 않은 제안을 하는 것은 함께 놀이에서 아이의 놀이를 방해하지 않고 존중하며 아이가 놀이를 이끌어 나갈 수 있는 힘을 길러주는 것입니다. \
            평소에 아이와 놀이할 때 부모가 하고 싶은 방향으로 놀이를 제안하거나 지시하지 않는지 점검해 주세요. \
            ☞ 아이와 놀이를 할 때 아이가 한 가지 놀이만 반복하더라도, 부모가 새로운 놀잇감으로 갑자기 꺼내와서 몰입하고 있는 놀이를 방해하지 마세요. \
            예를 들어, 공룡만 가지고 논다고 갑자기 “우리 이번엔 저기 블록놀이하자” 하며 놀이를 변경하지 말고 “공룡이 어디를 갈까?”라며 아이가 관심을 가지고 있는 놀이를 가지고 자연스럽게 놀이를 확장할 수 있습니다. ",
            "아동의 놀이를 돕거나 확장하기 위해 지시적으로 제안하지 않네요. \
            아동의 놀이를 돕거나 확장하기 위해 지시적으로 제안하지 않는 것은 아이의 놀이를 방해하지 않고 존중하며 아이가 놀이를 이끌어 나갈 수 있는 힘을 길러주는 것입니다. \
            ☞ 아동과 하던 놀이를 지속하고 있다면 그대로 놀이해도 좋고, 그 놀이 속에서 조금 더 확장해서 놀아주세요. \
            예를 들어, 공룡만 가지고 논다면, “나도 공룡이다. 공룡이 어디에 갈까?”라며 아이가 흥미를 보이는 놀잇감을 가지고 새로운 놀이 상황으로 이어나가는 것입니다. "
        ]}, 
        {"v3327":[
            "놀이상황에 따른 아동의 감정표현에 대해 공감적으로 반응을 한다.",
            "놀이 상황에 따른 아동의 감정 표현에 대해 공감적으로 반응을 한다는 것은 아이의 놀이를 잘 이해하고 놀이 속에서 아이의 감정을 충분히 알아차리고 있다는 것입니다. \
            평소 아이가 느끼는 느낌에 대해 이해하기 어렵고 공감을 해주지 않는 모습을 보이는지, 아이와의 놀이가 어렵지는 않은지 점검해 주세요. \
            ☞ 놀이 속에서 아이가 어떤 감정을 느끼는지 생각해 보시고 표현하는 감정에 공감해 주세요. \
            예를 들어, 아이가 블록이 잘 안 끼워져서 “안되잖아~ 짜증 나”라고 말한다면, “블록이 잘 안 끼워져서 속상하구나”라고 말해주세요. \
            놀이 속에서 부모가 아이의 감정을 잘 읽어준다면, 아이의 놀이는 다시 편안하게 이어져나갈 것입니다.",
            "놀이 상황에 따른 아동의 감정 표현에 대해 공감적으로 반응을 하는 모습을 보이네요. \
            놀이 상황에 따른 아동의 감정 표현에 대해 공감적으로 반응을 한다는 것은 아이의 놀이를 잘 이해하고 놀이 속에서 아이의 감정을 충분히 알아차리고 있다는 것입니다. \
            ☞ 지금처럼 놀이 상황에 따른 아동의 감정 표현에 대해 공감적 반응을 보이면 아이는 부모와의 놀이를 더욱 즐거워하고 놀이도 더욱 확장될 것입니다. \
            “마음대로 안되는구나.”, “속상하구나”하고 아이의 감정을 공감해 주고, 때로는 엄마의 감정도 표현해 보세요."
        ]}, 
        {"v3328":[
            "아동이 어떤 욕구를 가지고 있는지 알아차려 반응한다.",
            "아동이 어떤 욕구를 가지고 있는지 알아차려서 반응한다는 것은 아이의 욕구를 민감하게 알아차리고 반응해 준다는 것입니다. \
            평소에 부모가 아이의 욕구를 파악하는 게 어렵지는 않은지 점검해 주세요. \
            ☞ 부모는 아이의 행동을 잘 관찰하여 아이가 진짜 원하는 욕구가 무엇인지 좀 더 살펴보아야 합니다. \
            예를 들어, 놀이터에서 놀다가 밥 먹으러 집에 가야 하는데 “배 안 고파”라고 한다면 “더 놀고 싶어요”라는 아이의 욕구를 생각해 볼 수 있고, \
            엄마가 바빠서 못 놀아준다고 할 때 “엄마 미워!”라고 한다면 “같이 놀고 싶어요”라는 아이의 욕구가 있음을 알아차려주세요.",
            "아동이 어떤 욕구를 가지고 있는지 알아차려서 반응해 주고 있네요. \
            아동이 어떤 욕구를 가지고 있는지 알아차려서 반응한다는 것은 아이의 욕구를 민감하게 알아차리고 반응해 준다는 것입니다. \
            ☞ 아동이 자신의 원하는 욕구를 알고 반응해 줄 때, 눈 맞춤이나 머리를 쓰다듬기 등 비언어적 반응도 함께해 주면 좋습니다."
        ]}, 
        {"v3329":[
            "아동이 어떤 생각과 의도를 가지고 있는지 이해하고 언어적 비언어적으로 반응한다.",
            "아동이 어떤 생각과 의도를 가지고 있는지 이해하고 언어적 비언어적으로 반응한다는 것은 부모가 아이의 숨은 감정과 욕구를 잘 이해하고 민감하게 반응해 준다는 것입니다. \
            아이의 말이나 행동에서 어떤 생각이 나 의도를 가지고 있는지 이해하는 게 어렵지는 않은지 점검해 주세요. \
            ☞ 아이가 자신의 생각을 이야기할 때, 집중하여 들어주시고 다시 한번 “이렇게 하고 싶다는 거지?”라고 다시 질문하며 부모가 아이의 말이나 행동을 경청하고 이해하려 한다는 것을 알려주세요. \
            미소 짓기, 엄지 척하기 등 비 언어적인 반응도 아이의 모습을 이해하려 하는 반응입니다. ",
            "아동이 어떤 생각과 의도를 가지고 있는지 이해하고 언어적 비언어적으로 반응하고 있네요. \
            아동이 어떤 생각과 의도를 가지고 있는지 이해하고 언어적 비언어적으로 반응한다는 것은 부모가 아이의 숨은 감정과 욕구를 잘 이해하고 민감하게 반응해 준다는 것입니다. \
            ☞ 아이의 생각과 의도를 이해할 때는 언어적으로 표현해 줄 수도 있지만 끄덕임, 미소 짓기와 같은 비언어적인 방법으로 아이에게 이해한다는 반응을 전달해 줄 수도 있습니다. "
        ]}, 
        {"v332A":[
            "아동이 가진 생각과 계획을 알아차리고 그에 맞는 거절, 수용의 반응을 보인다.",
            "아동이 가진 생각과 계획을 알아차리고 그에 맞는 거절, 수용의 반응을 보이는 것은 되는 것 안 되는 것에 대해 명확한 기준을 아이에게 전달하며 일관성 있게 양육을 할 수 있다는 것입니다. \
            평소에 되는 것과 안 되는 것에 대한 기준이 명확히 하고 이를 아이가 받아들일 수 있는지 점검해 주세요 \
            ☞ 아이가 안 되는 것을 요구할 때는 안 되는 이유에 대해 아이의 눈높이에서 설명해 주고 대안을 제시 주세요. \
            수용할 수 있는 부분이라면 바로 수용해 주시는 게 좋습니다.",
            "아동이 가진 생각과 계획을 알아차리고 그에 맞는 거절, 수용의 반응을 보이네요. \
            아동이 가진 생각과 계획을 알아차리고 그에 맞는 거절, 수용의 반응을 보이는 것은 되는 것 안 되는 것에 대해 명확한 기준을 아이에게 전달하며 일관성 있게 양육을 할 수 있다는 것입니다. \
            ☞ 지금처럼 아동이 가진 생각과 계획을 알아차리고 그에 맞는 거절, 수용의 반응을 보이면서 아이의 마음이 거절되었을 때는 ‘하기 힘들었을 텐데 열심히 해줘서 고마워’라고 이야기하며 아이의 마음을 다독여 주세요. "
        ]}
    ]}, 
    {"정서적 유대" :[
        {"v3331":[
            "아동의 얼굴을 응시한다.",
            "부모가 아의 얼굴을 응시하는 것은 부모가 아이에게 관심을 가지고 있고 눈높이에 맞추어 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            부모는 평소의 아이를 따뜻한 시선으로 바라보고 있는지, 서로 친밀한 관계를 형성하고 있는지 점검해 보세요. \
            ☞ 아이가 공을 굴리고 있다면 공에 관심을 보이고 놀이하면서 아이와 눈 맞춤도 해주세요. \
            아이를 마주 보고 아이의 얼굴을 바라본다는 것은 아이에게 정서적인 따뜻함을 전달하는 것입니다.",
            "아이의 얼굴을 잘 응시하고 있는 모습을 보여요. \
            부모가 아의 얼굴을 응시하는 것은 부모가 아이에게 관심을 가지고 있고 눈높이에 맞추어 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            ☞ 아이의 얼굴을 보며 눈 맞춤을 해주고 미소를 지어준다면 아이는 엄마와 정서적으로 따뜻한 교감을 하면서 놀이를 할 수 있습니다."
        ]}, 
        {"v3332":[
            "아동의 시선을 눈으로 따라간다.", 
            "부모가 아동의 시선을 눈으로 따라가는 것은 아이의 놀이에 관심을 보이고, 함께 놀이를 잘 따라가 준다는 것입니다. \
            평소에 아이의 놀이에 집중하거나 따라가는 것이 힘들지는 않은지 점검해주세요. \
            ☞ 축구장에서 해설자가 해설을 하듯이, 아이가 공룡을 가지고 쿵쿵가고 있으면 ‘공룡이 쿵쿵가네’라고 말로 표현해줄 수도 있고, 말없이 눈으로 공룡이 가고 있는 위치를 함께 따라가주세요. \
            아이는 부모의 시선만으로도 함께 놀이하고 있다는 느낌을 갖을 것입니다.", 
            "부모의 시선이 아이를 잘 따라가고 있네요. \
            부모가 아동의 시선을 눈으로 따라가는 것은 아이의 놀이에 관심을 보이고, 함께 놀이를 잘 따라가 준다는 것입니다. \
            ☞ 아이가 놀이 속에서 어디를 바라보고 있는지 함께 바라봐 주세요. \
            거울처럼 아이가 보고 웃는다면 부모도 웃어주고, 아이가 삑삑 소리를 내면 부모도 삑삑하고 소리를 내주어도 좋아요. \
            부모와 아이가 함께 관심을 공유하며 친밀한 상호작용이 이루어지면 아이는 정서적 안정감을 가지고 성장할 수 있습니다."
        ]}, 
        {"v3333":[
            "아동과의 눈 맞춤이 자연스럽다.",
            "아이와의 눈 맞춤이 자연스럽다는 것은 아이와 부모가 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            아이와 함께 하는 놀이 시간이 즐거운지, 평소의 아이를 바라보는 시간이 충분한지 점검해 보세요. \
            ☞ 아이랑 긍정적 상황일 때 눈 맞춤을 많이 해주세요. \
            숨바꼭질, 이불 그네 태우기 등 자연스러운 놀이 속에서 눈 맞춤을 해주면 더욱 좋습니다. \
            즐거운 놀이를 통해 자연스러운 눈 맞춤이 이루어진다면 더욱 아이와 친밀한 관계를 형성해 나갈 수 있습니다.",
            "아이와 자연스러운 눈 맞춤이 자연스럽네요. \
            아이와의 눈 맞춤이 자연스럽다는 것은 아이와 부모가 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            ☞ 아이와 놀이를 통해 자연스러운 눈 맞춤을 많이 해주면 아이는 정서적으로 더욱 편안해집니다. \
            때로는 눈 맞춤을 하면서 미소를 보이고 “~이 눈이 반짝반짝 빛나네”라고 말해주거나 윙크를 하면서 정서 교감을 하는 것도 좋습니다."
        ]}, 
        {"v3334":[
            "아동에게 긍정적인 신체적 접촉을 시도한다.",
            "아동에게 긍정적인 신체적 접촉을 시도한다는 것은 부모와 아이가 신체 접촉을 통해 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            평소에 아이가 부모 사이에 스킨십을 통해 서로 따뜻하고 친밀한 관계를 형성하고 있는지 점검해 보세요. \
            ☞ 아이와 눈을 마주치며 대화를 하거나 자주 안아주고, 머리를 쓰다듬어 주는 등의 긍정적인 신체 접촉을 통해 아이는 사랑받는 존재라고 느낀답니다. \
            부드럽게 로션을 발라주거나 토닥여 주는 등 신체적 접촉을 통해 정서적 교감을 나눌 수 있도록 도와주세요.",
            "아동에게 긍정적인 신체적 접촉을 시도하고 있네요. \
            긍정적인 신체적 접촉을 시도한다는 것은 부모와 아동이 따뜻하고 친밀한 관계를 형성하고 있다는 것입니다. \
            ☞ 안아주기, 머리 쓰다듬기 등의 긍정적인 신체적 접촉을 하면서 “잘하고 있구나”, “00이가 뽀뽀해 주니까 너무 행복하다.”라며 긍정적인 말도 함께해 주면 더욱 좋습니다. "
        ]}, 
        {"v3335":[
            "아동의 신체적 접촉을 수용한다.",
            "아동이 신체적 접촉을 수용한다는 것은 신체적으로 부모와의 따뜻하고 친밀한 관계가 잘 형성되어 있고 신체반응에도 예민하지 않다는 것입니다. \
            평소에 부모나 아이가 신체적 접촉에 예민한 반응을 보이거나 불편한 감정은 없는지 점검해 보세요. \
            ☞ 아이에게 평소에 하이파이브나 등 토닥거림 등의 자연스러운 신체 접촉을 할 수 있는 칭찬을 해주시면서 신체적 접촉을 통해 편안한 감정을 많이 느낄 수 있도록 해주세요.",
            "아이가 신체적 접촉을 잘 수용하고 있네요. \
            신체적 접촉을 수용한다는 것은 신체적으로 부모와의 따뜻하고 친밀한 관계가 잘 형성되어 있고 신체반응에도 예민하지 않다는 것입니다. \
            ☞ 아이가 신체적 접촉을 수용할 때 “~ 이를 안으니 너무 포근하다.”라고 말하며 긍정적인 표현을 해 주세요."
        ]}, 
        {"v3336":[
            "아동의 행동에 대해 격려, 칭찬, 지지를 한다.",
            "아동의 행동에 대해 격려, 칭찬, 지지를 한다는 것은 부모와 아이가 언어적 상호작용을 통해 따뜻하고 친밀한 관계를 잘 형성하고 있다는 것입니다. \
            부모는 평소에 아동의 행동에 대해 격려와 칭찬이 잘하고 있는지 점검해 주세요. \
            ☞ 아동의 행동에 대해 칭찬을 할 때는 무조건 “멋있어”, “잘한다”라는 칭찬보다는 행동이나 상황에 대해 구체적으로 언급하며 칭찬하는 것이 좋아요. \
            예를 들어 보라색 코끼리를 그려온 아이에게 “코끼리 다리가 엄청 튼튼해 보이는구나.”라며 구체적으로 칭찬해 주세요.",
            "아동의 행동에 대해 격려, 칭찬, 지지를 하는 모습을 보이네요. \
            아동의 행동에 대해 격려, 칭찬, 지지를 한다는 것은 부모와 아이와 언어적 상호작용을 통해 따뜻하고 친밀한 관계를 잘 형성하고 있다는 것입니다. \
            ☞ 칭찬을 할 때는 결과가 아닌 과정을 칭찬해 주세요. \
            예를 들면, “저번에는 줄넘기를 3번 넘겼는데, 오늘은 4번까지 해냈네. 노력하는 모습이 정말 보기 좋아”, “열심히 연습해서 1번 더 넘었구나”, “포기하지 않고 계속하는 모습이 멋있다.”등 구체적인 칭찬을 해주세요."
        ]}, 
        {"v3337":[
            "신체적 지원 및 언어적인 지원이 동시에 이루어진다.",
            "신체적 지원 및 언어적인 지원이 동시에 이루어진다는 것은 부모가 아이에게 온몸으로 따뜻하고 친밀하게 정서 교감을 잘 하고 있다는 것입니다. \
            평소에 아이의 욕구를 잘 파악하고 신체, 언어적으로 잘 지지해 주는지 점검해 주세요. \
            ☞ 아이가 도움이 필요할 때 “우리 같이 해볼까?”라고 이야기하며 어떻게 해야 하는지 설명하고 함께 할 수도 있고, 신체적인 움직임이 필요할 때는 함께해 주면서 아이가 부모와의 더욱 편안하고 안정적인 관계를 형성할 수 있도록 도와주세요.",
            "신체적 지원 및 언어적인 지원이 동시에 이루어지고 있네요. \
            신체적 지원 및 언어적인 지원이 동시에 이루어진다는 것은 부모가 아이에게 온몸으로 따뜻하고 친밀하게 정서 교감을 잘 하고 있다는 것입니다. \
            ☞ 지금처럼 신체적 지원 및 언어적인 지원을 동시에 해준다면, 아이는 부모와의 정서적 유대감을 충분히 느끼고, 부모와 함께 있는 시간 동안 충분한 에너지를 느낄 수 있습니다."
        ]}
    ]}, 
    {"즐거움 공유" :[
        {"v3341":[
            "아동의 움직임 수준에 맞춘다.",
            "아동의 움직임 수준에 맞춘다는 것은 아이의 놀이 속도에 맞추어 아이와 함께 놀이를 즐겁게 하고 있다는 것입니다. \
            놀이를 할 때 부모가 아동의 활동 에너지에 맞추어 즐겁게 놀이하고 있는지 점검해 주세요. \
            ☞ 놀이를 할 때, 아이의 행동을 바라보고 잠깐 멈추어 기다려 주거나 함께 움직이면서 부모가 아이의 움직임 수준에 맞추어 놀이해 주세요.",
            "부모는 아동의 움직임 수준에 맞추어 주고 있네요.\
            아동의 움직임 수준에 맞춘다는 것은 아이의 놀이 속도에 맞추어 아이와 함께 놀이를 즐겁게 하고 있다는 것입니다. \
            ☞ 아이가 너무 빠르게 움직일 때에는 함께 빨리 움직여주고, 아이가 조금 천천히 가려고 하면 함께 천천히 움직이면서 아이와 함께 놀이의 즐거움을 느낄 수 있도록 해 주세요. "
        ]}, 
        {"v3342":[
            "긍정적인 표정이 나타난다.",
            "긍정적인 표정이 나타난다는 것은 부모가 아이와 함께 하는 놀이를 즐거워하고 표정으로 교감한다는 것입니다. \
            부모는 놀이를 하면서 지루해 하거나 힘들어하는 마음을 얼굴로 나타내는 것은 아닌지 점검해 주세요. \
            ☞ 놀이를 할 때 아이에게 미소 짓기, 손뼉 쳐 주기 등을 하며 놀이가 즐겁다는 것을 아이가 느낄 수 있도록 표정으로 보여주세요. \
            아이는 부모의 긍정적인 표정을 통해 함께 하는 놀이의 즐거움을 공유할 것입니다.",
            "아이와의 놀이에서 긍정적인 표정이 나타나네요. \
            긍정적인 표정이 나타난다는 것은 부모가 아이와 함께 하는 놀이를 즐거워하고 표정으로 교감한다는 것입니다. \
            ☞ 지금처럼 아이와 놀이를 할 때 긍정적인 표정을 지어주거나 크게 웃어주면서 긍정적인 반응을 보여주면 아이는 부모와의 놀이에서 더 즐거움을 느낄 수 있습니다. "
        ]}, 
        {"v3343":[
            "놀이의 즐거움에 대해 언어적으로 표현한다.",
            "놀이의 즐거움을 언어적으로 표현한다는 것은 아이와의 놀이에서 언어적 의사소통을 통하여 정서적으로 즐거움을 함께 하고 있다는 것입니다. \
            평소에 아이와 놀이할 때 언어적으로 즐거움을 표현하고 정서 교감을 하고 있는지 점검해 보세요. \
            ☞ 부모는 아이와 놀이를 하면서 즐거움을 언어로 표현하면서 정서표현의 모델링이 되어 주세요. \
            예를 들어, “우와! 냉장고에서 얼음도 나오네. 정말 재미있다”라고 이야기해 줄 수 있습니다.",
            "놀이의 즐거움을 언어적으로 잘 표현해 주고 있네요. \
            놀이의 즐거움을 언어적으로 표현한다는 것은 아이와의 놀이에서 언어적 의사소통을 통하여 정서적으로 즐거움을 함께 하고 있다는 것입니다. \
            ☞ 지금처럼 놀이를 하면서 즐거움을 언어로 표현해 주세요. \
            “~ 이와 함께 노니까 너무 재미있다.”라고 말하며 언어적으로 즐거움을 표현하면서 아이와 즐거움을 공유할 수 있습니다."
        ]}, 
        {"v3344":[
            "놀이의 즐거움에 대해 동작으로 표현한다.",
            "놀이의 즐거움이 동작으로 표현된다는 것은 놀이의 즐거움을 몸으로 잘 표현하면서 정서 교감을 하고 있다는 것입니다. \
            아이와 놀이의 즐거움을 몸으로 교감하면서 상호작용을 하고 있는지 점검해 주세요. \
            ☞ 아이와 놀이를 하면서 즐거운 표정을 짓거나, 하이파이브 하기 등을 하며 놀이에 대한 즐거움을 몸으로 표현해 주세요.",
            "놀이의 즐거움에 대해 동작으로 잘 표현하고 있네요. \
            놀이의 즐거움이 동작으로 표현된다는 것은 놀이의 즐거움을 몸으로 잘 표현하면서 정서 교감을 하고 있다는 것입니다. \
            ☞ 지금처럼 아이와의 놀이에 대한 즐거움을 몸으로 표현하면서 놀이해 주면 아이는 부모와의 놀이에서 더욱 정서 교감을 하며 놀이의 즐거움을 느낄 수 있습니다."
        ]}]}, 
    {"논리적 설명" :[
        {"v3351":[
            "아이의 설명에 귀를 기울이고 반응한다.",
            "아이의 설명의 귀를 기울이고 반응하는 것은 아이의 이야기를 잘 듣고 논리적인 상호작용 능력을 키워주는 것입니다. \
            부모는 평소에 아이가 설명할 때 온전히 집중하여 듣고 반응해 주는지 점검해 주세요. \
            ☞ 아이가 이야기할 때 핸드폰이나 보면서 듣지 않고 눈을 바라보고 들으며 아이의 말을 잘 이해하고 있다는 것을 느낄 수 있도록 고개를 끄떡이거나 으음 과 같은 추임새를 넣어 집중해서 반응해 주세요.",
            "아이의 설명의 귀를 기울이고 반응하는 것은 아이의 이야기를 잘 듣고 논리적인 상호작용 능력을 키워주는 것입니다. \
            ☞ 지금처럼 아이의 말에 경청하면서 “아, 그래서 00이가 그렇게 했다는 말이지?” 등으로 아이의 말을 이해하고 확인해 주세요. \
            또한 아동이 길게 이야기할 때는 요약해서 말해주는 등 아동의 말에 집중해서 들어주고 반응해 주는 것이 좋습니다."
        ]}, 
        {"v3352":[
            "아이가 한 말을 부정하지 않고 수용한다.",
            "아이가 한 말을 부정하지 않고 수용한다는 것은 아이의 의견을 존중하고 잘 수용해 준다는 것입니다. \
            평소에 아이의 의견을 무시하거나 비난하지 않는지 점검해 보세요. \
            ☞ 아이가 부모와 반대되는 의견을 이야기할 때, “너의 생각은 그렇구나”라고 이야기하며 아이의 말을 비난하지 말고 그대로 수용해 주세요. \
            그런 후 안 되는 이유에 대해 아이의 눈높이에 맞춰 아이가 이해할 수 있도록 설명해 주세요. ",
            "아이가 한 말을 부정하지 않고 수용하는 모습을 보이네요. \
            아이가 한 말을 부정하지 않고 수용한다는 것은 아이의 의견을 존중하고 잘 수용해 준다는 것입니다. \
            ☞ 지금처럼 아이가 한 말을 부정하지 않고 있는 그대로 수용해 주면서 들어주세요. \
            아이가 엄마의 이야기를 잘 들어주면 “엄마 이야기 들어줘서 고마워”라고 말하며 아이에게 고마움을 표현해 주세요."
        ]}, 
        {"v3353":[
            "아이의 잘못에 대해 이유를 설명해준다.",
            "아이의 잘못에 대해 이유를 설명한다는 것은 아이의 잘못을 논리적으로 잘 설명해 준다는 것입니다. \
            평소에 아이가 잘못할 때 이유를 설명하지 않고 혼내고 있지는 않은지 점검해 주세요. \
            ☞ 아이가 잘못된 행동을 했을 때에는 아이의 눈높이에 맞춰서 잘못한 이유에 대해 논리적으로 설명해 주어야 합니다. \
            아이가 이해할 수없이 야단만 맞는다면 아이는 잘못은 알 수 없습니다. ",
            "아이의 잘못에 대한 이유를 논리적으로 잘 설명하고 있네요. \
            아이의 잘못에 대해 이유를 설명한다는 것은 아이의 잘못을 논리적으로 잘 설명해 준다는 것입니다. \
            ☞ 지금처럼 아이의 잘못된 행동에 대해 아이의 눈높이에 맞추어 논리적으로 설명해 주고, 아이가 자신의 행동을 수정했을 때 칭찬해 주면 아동의 긍정적인 행동이 더 늘어날 것입니다."
        ]}, 
        {"v3354":[
            "필요한 규칙에 대해 말해준다.",
            "필요한 규칙에 대해 말해준다는 것은 논리적 설명으로 통해 아이가 자신의 욕구를 스스로 조절할 수 있도록 도와주는 것입니다. \
            평소에 아이에게 필요한 규칙을 말로 잘 설명해 주고 있는지 점검해 주세요. \
            ☞ 규칙을 지키면서 자신의 욕구대로 행동하지 못해 속상한 아이의 마음을 공감해 주고, 규칙을 잘 지킨 아이의 행동에 대해서는 칭찬해 주세요. ",
            "필요한 규칙에 대해 말로 잘 설명해 주고 있네요. \
            필요한 규칙에 대해 말해준다는 것은 논리적 설명으로 통해 아이가 자신의 욕구를 스스로 조절할 수 있도록 도와주는 것입니다. \
            ☞ 부모가 아이에게 필요한 규칙에 대해 논리적으로 설명해 주면서 규칙을 배우는 아이의 모습을 격려해 주고 지지해 주세요. \
            규칙을 잘 지켰다면 칭찬을 통해 아이의 행동을 더욱 강화해 주고, 아이는 이러한 과정을 반복하면서 더욱 긍정적인 감정과 규칙을 지켜나가는 데 있어 만족감을 느끼게 됩니다."
        ]}, 
        {"v3355":[
            "무리한 요구를 하면 왜 안되는지 이유를 설명해준다.",
            "무리한 요구를 하면 왜 안 되는지 이유를 설명해 준다는 것은 제한된 행동에 대해 논리적으로 잘 설명해 준다는 것입니다. \
            평소에 아이가 무리한 요구를 할 때 설명해 주지 않고 야단치거나 하지는 않는지 점검해 주세요. \
            ☞ 아이는 감정조절이 미숙하여 자기의 기분에 따라 무리한 요구나 행동을 할 수 있습니다. \
            이때 부모는 아이의 감정을 잘 들어주고, 논리적으로 행동에 대해 설명해주면 아이는 점차 자기의 욕구를 이해하고 행동을 조절하는 법을 배우게 됩니다. ",
            "무리한 요구를 할 때 왜 안 되는지 이유를 논리적으로 잘 설명해 주고 있네요. \
            무리한 요구를 하면 왜 안 되는지 이유를 설명해 준다는 것은 제한된 행동에 대해 논리적으로 잘 설명해 준다는 것입니다. \
            ☞ 지금처럼 무리한 요구를 할 때 감정은 수용해 주되, 행동은 왜 안 되는지 잘 설명해 주면 아이는 자신의 감정을 수용 받으면서 행동 제한에 대한 부분을 배우게 됩니다. \
            아이가 부모의 말을 잘 수용하고 받아 드릴 때는 칭찬을 통해 긍정적인 자아상을 만들어나갈 수 있도록 해 주세요."
        ]}]},    
];
//--------------------------------------------------------------------------------------------------------------------------------------------
let hIndex = 0;
$(document).ready(function() {
    stressForm(data21, 'child-stress');
    stressForm(data22, 'parent-stress');
    stressForm(data23, 'life-stress');
    interactionForm(data32, "child-interaction");
    interactionForm(data33, "parent-interaction");

    let $hTabItems = $('.report-htab>ul>li');
    //console.log($hTabItems);
    let $vTabItems = $('.report-vtab>ul>li');
    //console.log($vTabItems);
    
    $hTabItems.click(function() {
        $hTabItems.removeClass('active');
        $(this).addClass('active');

        hIndex = $hTabItems.index($(this));
        console.log(hIndex);
        $('.report-hbox').hide().eq(hIndex).show();
        
        $vTabItems.eq((hIndex-1) * 3).trigger("click");

        //$('.docu').hide();
        if (hIndex == 0) {
            $('.prev').hide();
            $('.next').show();
            //$(".report-hbox").niceScroll().remove();
            //$(".report-vbox").niceScroll().remove();
        } else if(hIndex == 3) {
            $('.prev').show();
            $('.next').hide();
            //$('.docu').show();
            $(".report-hbox").niceScroll({cursorborder:"",cursoropacitymin:0.4,cursorcolor:"#ccc",boxzoom:false});
            $(".report-vbox").niceScroll().remove();
        } else {
            $('.prev').show();
            $('.next').show();
            $(".report-vbox").niceScroll({cursorborder:"",cursoropacitymin:0.4,cursorcolor:"#ccc",boxzoom:false});
            //$(".report-hbox").niceScroll().remove();
        }
        setAnchor(hIndex, 0);
    });

    $hTabItems.eq(0).trigger("click");

    $vTabItems.click(function() {
        $vTabItems.removeClass('active');
        $(this).addClass('active');

        let index = $vTabItems.index($(this));
        $('.report-vbox').hide().eq(index).show();

        setAnchor(hIndex, index);
    });

    //console.log($('.next'))
    $('.next').click(function(){
        $hTabItems.eq(hIndex + 1).trigger("click");	
    });

    $('.prev').click(function(){
        $hTabItems.eq(hIndex - 1).trigger("click");	
    });

    $('.go-preview').click(function(){
        preview();
    });

    $('.preview').click(function(){
        $("form").submit();
    });
    $('.dim-layer .dim-bg').click(function(){
        $('.dim-layer').fadeOut();
        return false;
    });

    $('.close').click(function(){
        $('.dim-layer').fadeOut();
        $("#report-alert").hide();
        $("#report-preview").hide();
        return false;	
    });
    //$("#preview").attr("href","K-PSI-4_preview.html");

    //$vTabItems.eq(hIndex * 3).trigger("click");

    $(".datepicker").datepicker({
        dateFormat: 'yy년 mm월 dd일' //Input Display Format 변경
        ,showOtherMonths: true //빈 공간에 현재월의 앞뒤월의 날짜를 표시
        ,showMonthAfterYear:true //년도 먼저 나오고, 뒤에 월 표시
        ,changeYear: true //콤보박스에서 년 선택 가능
        ,changeMonth: true //콤보박스에서 월 선택 가능                
        ,showOn: "both" //button:버튼을 표시하고,버튼을 눌러야만 달력 표시 ^ both:버튼을 표시하고,버튼을 누르거나 input을 클릭하면 달력 표시  
        ,buttonImage: "./images/common/calendar.png" //버튼 이미지 경로
        ,buttonImageOnly: true //기본 버튼의 회색 부분을 없애고, 이미지만 보이게 함
        ,buttonText: "선택" //버튼에 마우스 갖다 댔을 때 표시되는 텍스트                
        ,yearSuffix: "년" //달력의 년도 부분 뒤에 붙는 텍스트
        ,monthNamesShort: ['1','2','3','4','5','6','7','8','9','10','11','12'] //달력의 월 부분 텍스트
        ,monthNames: ['1월','2월','3월','4월','5월','6월','7월','8월','9월','10월','11월','12월'] //달력의 월 부분 Tooltip 텍스트
        ,dayNamesMin: ['일','월','화','수','목','금','토'] //달력의 요일 부분 텍스트
        ,dayNames: ['일요일','월요일','화요일','수요일','목요일','금요일','토요일'] //달력의 요일 부분 Tooltip 텍스트
        ,minDate: "-10Y" //최소 선택일자(-1D:하루전, -1M:한달전, -1Y:일년전)
        ,maxDate: "+1M" //최대 선택일자(+1D:하루후, -1M:한달후, -1Y:일년후)                
    });                    
    
    //초기값을 오늘 날짜로 설정
    $('.datepicker').datepicker('setDate', 'today'); //(-1D:하루전, -1M:한달전, -1Y:일년전), (+1D:하루후, -1M:한달후, -1Y:일년후)            

    console.log($('form'))

    $.validator.setDefaults({ ignore: '' });
    var validator = $("form").validate({
        invalidHandler: function() {
            console.log( validator.numberOfInvalids() + " field(s) are invalid" );
            if (validator.numberOfInvalids() > 0) {
                showLayerPopup('report-alert');
                console.log(validator.numberOfInvalids());
                $('#invalid-count').text(validator.numberOfInvalids());
            }
        },
        errorPlacement: function(error, element) {
            // don't add the error labels
            // if ( element.is(":radio") ) 
            // {
            // 	element.parents().addClass("error");
            // } 
            return true;
        },
        submitHandler: function(form) {
            // 필요에 따라 ajax를 사용한 제출등으로 변경가능.
            preview();
            return false;
        }
    });
    console.log(validator);

    //$( "input" ).checkboxradio();
    
    $('.print-pdf').click(async function(){
        $data.title = $nPage;
        $('.report-processing-table').show();
        console.log("start");
        await HTML2PDF();	
        console.log("end");
        $('.report-processing-table').hide();
    });
}); //ready

function setAnchor(hIndex, vIndex) {
    console.log(hIndex + ":" + vIndex);
    if (hIndex == 0) {
        $("#preview").attr("href","#cover");
    } else if (hIndex == 1) {
        if (vIndex == 0) {
            $("#preview").attr("href","#report-part21");
        } else if (vIndex == 1) {
            $("#preview").attr("href","#report-part22");
        } else if (vIndex == 2) {
            $("#preview").attr("href","#report-part23");
        }
    } else if (hIndex == 2) {
        if (vIndex == 3) {
            $("#preview").attr("href","#report-part4");
        } else if (vIndex == 4) {
            $("#preview").attr("href","#report-part5");
        } else if (vIndex == 5) {
            $("#preview").attr("href","#report-part7");
        }
    } else {
        $("#preview").attr("href","#report-part9");
    }
}

function showLayerPopup(id) {
    let $el = $(`#${id}`);

    $el.show();

    $('.dim-layer').fadeIn();

    let $elWidth = ~~($el.outerWidth()),
        $elHeight = ~~($el.outerHeight()),
        docWidth = $(document).width(),
        docHeight = $(document).height();

    if ($elHeight < docHeight || $elWidth < docWidth) {
        $el.css({
            marginTop: -$elHeight / 2,
            marginLeft: -$elWidth / 2
        });
    } else {
        $el.css({top: 0, left: 0});
    }		
}

function preview() {
    showLayerPopup('report-preview');
    previewReport();
    initProgress();	
}
//--------------------------------------------------------------------------------------------------------------------------------------------
function interactionForm(data, tbodyId) {

    $tBody = $(`#${tbodyId}`);

    let $groupTR, $groupTH, $groupItemTH, $groupItemTD  ;
    let $groupKey = "";
    data.forEach(data => {
        //console.log(data);
        for (const [groupKey, group] of Object.entries(data)) {
            console.log(`${groupKey} ${group.length}`); //주도성

            group.forEach(groupItems => {
     
                // console.log(groupItems);
                console.log(Object.keys(groupItems)[0]);
                console.log(Object.values(groupItems)[0][0]);
                
                $groupTR = $(`<tr></tr>`);

                if ($groupKey != groupKey) {
                    $groupTH = $(`<th scope="row" rowspan="${group.length}">${groupKey}</th>`);
                    $groupTR.append($groupTH);

                    $groupKey = groupKey;
                }

                $groupItemTH = $(`<th scope="row" class="left">${Object.values(groupItems)[0][0]}</th>`);
                $groupItemTD = answerForm(Object.keys(groupItems)[0]);
                
                $groupTR.append($groupItemTH);
                $groupTR.append($groupItemTD);
                $tBody.append($groupTR);
            }); //forEach
        } //for
    }); // group

    console.log($tBody);
}

function answerForm(key) {
    let $td = $(`<td></td>`);
    let $radio1 = $(`<input type="radio" name="${key}" id="${key}-1" value="0" required><label style="margin-right:5px" for="${key}-1"><i></i> 미약</label>`);
    let $radio2 = $(`<input type="radio" name="${key}" id="${key}-2" value="1" required><label style="margin-right:5px" for="${key}-2"><i></i> 보통</label>`);
    let $radio3 = $(`<input type="radio" name="${key}" id="${key}-3" value="2" required><label style="margin-right:5px" for="${key}-3"><i></i> 양호</label>`);
    let $radio4 = $(`<input type="radio" name="${key}" id="${key}-4" value="3" required><label for="${key}-4"><i></i> 최적</label>`);
    $td.append($radio1); $td.append($radio2); $td.append($radio3); $td.append($radio4);
    return $td;
}

  
function stressForm(data, tbodyId) {
  //debugger;  
    $tBody = $(`#${tbodyId}`);
   
    let $tr, td1, td2;
    let i = 0;
    for (;i < data.keys.length; i+=2) {
        $tr = $(`<tr></tr>`);
        $td1 = $(`<th scope="row"><label for="${data.keys[i]}">${data.labels[i]}</label></th>`);
		$td2 = $(`<td><input type="number" name="${data.keys[i]}" id="${data.keys[i]}" class="input number" min="0" max="100" required></td>`);
        $tr.append($td1);
        $tr.append($td2);
        if (i + 1 <  data.keys.length) {
            $td1 = $(`<th scope="row"><label for="${data.keys[i+1]}">${data.labels[i+1]}</label></th>`);
		    $td2 = $(`<td><input type="number" name="${data.keys[i+1]}" id="${data.keys[i+1]}" class="input number" min="0" max="100"  required></td>`);
        } else {
            $td1 = $(`<th scope="row"></th>`);
            $td2 = $(`<td></td>`);
        }
        $tr.append($td1);
        $tr.append($td2);

        $tBody.append($tr);
    }
}
//--------------------------------------------------------------------------------------------------------------------------------------------
let $reportContainer = $("#report-container");
let $reportPart;
let $pageContainer;
let $page;
let $top;
let $middle;
let $content;
let $bottom;
let $nPage = 1;

$data = {
    autoCheck: 32 ,
    size:32,
    bgColor:'#FFF',  
    bgOpacity: 0.5,    
    fontColor: false,
    title: '',
    isOnly:true
};

function previewReport() {
    $nPage = 1;
    //$data.title = $nPage;
    $reportContainer.empty();
    $('.report-processing-table').hide();
    //$('.report-processing-table').show();
    reportPart0();
    reportPart1();
    reportPart21();
    reportPart22();
    reportPart23();
    reportPart3();
    reportPart4();
    reportPart5();
    reportPart6();
    reportPart7();
    reportPart8();
    reportPart9();
    reportPart10();
    //$('.report-processing-table').hide();
}

function makeReportPart(partID) {
    $reportPart = $(`<div id="report-part${partID}"></div>`);    
}
function makePageContainer(pageNo) {
    //$reportPart = $(`<div class="report-part${fNo}"></div>`);
    //$('#page-no').text(pageNo);
    $pageContainer = $(`<div id="page${pageNo}" class="page-container"></div>`);
    $page = $('<div class="page"></div>');
    $top = $('<div class="top"></div>')
    $middle = $('<div class="middle"></div>')
    $content = $('<div class="content"></div>')
    $bottom = $(`<div class="bottom"><span class="page-no"> - ${pageNo} - </span></div>`)
}
function makePageContent() {
    $page.append($top);
    $page.append($middle);
    $middle.append($content);
    $page.append($bottom);
    $pageContainer.append($page);
    $reportPart.append($pageContainer);
 
    $reportContainer.append($reportPart);
    //$reportContainer.append($pageContainer);
}

function reportPart0() {
    makeReportPart(0);
    $pageContainer = $(`<div id="cover" class="page-container"></div>`);
    $page = $('<div class="page"></div>');
    let $cover = $('<div class="cover"></div>');

    let v0 = $('#v1121').val().trim();
    let v1 = $(':radio[name="v1132"]:checked').length==0?'':$(':radio[name="v1132"]:checked').val();
    let v2 = $('#v1131').val().trim()==''?'':($('#v1131').val().trim() + '세');
    let v3 = $('#v1122').val().trim();
    let v4 = $('#v1141').val().trim();
    let v5 = $('#v1142').val().trim();

    let $name = $(`<span class="name">${v0}</span>`);
    let $gender = $(`<span class="gender">${v1}</span>`);
    let $age = $(`<span class="age">${v2}</span>`);
    let $birthdate = $(`<span class="birth-date">${v3}</span>`);
    let $observationDate1 = $(`<span class="observation-date1">${v4}</span>`);
    let $observationDate2 = $(`<span class="observation-date2">${v5}</span>`);

    $cover.append($name);
    $cover.append($gender);
    $cover.append($age);
    $cover.append($birthdate);
    $cover.append($observationDate1);
    $cover.append($observationDate2);

    $page.append($cover);
    $pageContainer.append($page);
    $reportPart.append($pageContainer);

     
    $reportContainer.append($reportPart);
    //$reportContainer.append($pageContainer);

}

function reportPart1() {
    makeReportPart(1); 
    makePageContainer($nPage++);
    let v = "" //$('#v2151').val();
    $content.append($(`<div class="title"><img src="./images/report/no1.png" /><span>${$('#v1121').val()} ${$('#v1112').val()}의 양육스트레스</span></div>`));
    $content.append($(`<div class="subtitle"><span>검사소개</span></div>`));
    $content.append($(`<img src="./images/report/1_1.png">`));
    //$content.append($(`<div class="desc round-all mt40 h250">${v}</div>`));
    $content.append($(`<img class="img-1-2"src="./images/report/1_2.png" >`));

    makePageContent();
    
}

function reportPart21() {
    makeReportPart(21);
    makePageContainer($nPage++);
    let v = $('#v2151').val();
    $content.append($(`<div class="title"><img src="./images/report/no2.png" /><span>STRESS(1)</span></div>`));
    $content.append($(`<div class="subtitle"><span>자녀의 스트레스 영역</span></div>`));
    $content.append($(`<div class="chart"><canvas id="child_stress_chart" width="340" height="300"></canvas></div>`));
    $content.append($(`<div id="child_stress_table" class="table"></div>`));
    $content.append($(`<div class="desc round-all h250 mt140">${v}</div>`));
 
    makePageContent();

    stress("child_stress", "Child Stress", data21)
}

function reportPart22() {
    makeReportPart(22);
    makePageContainer($nPage++);
    let v = $('#v2251').val();
    $content.append($(`<div class="title"><img src="./images/report/no2.png" /><span>STRESS(2)</span></div>`));
    $content.append($(`<div class="subtitle"><span>양육자의 스트레스 영역</span></div>`));
    $content.append($(`<div class="chart"><canvas id="fosterer_stress_chart" width="340" height="300"></canvas></div>`));
    $content.append($(`<div id="fosterer_stress_table" class="table"></div>`));
    $content.append($(`<div class="desc round-all h180 mt210">${v}</div>`));
   
    makePageContent();

    stress("fosterer_stress", "Fosterer Stress", data22);
}

function reportPart23() {
    makeReportPart(23);
    makePageContainer($nPage++);
    let v = $('#v2331').val();
    $content.append($(`<div class="title"><img src="./images/report/no2.png" /><span>STRESS(3)</span></div>`));
    $content.append($(`<div class="subtitle"><span>생활 스트레스 영역</span></div>`));
    $content.append($(`<div class="chart"><canvas id="life_stress_chart" width="340" height="300"></canvas></div>`));
    $content.append($(`<div id="life_stress_table" class="table"></div>`));
    $content.append($(`<div class="desc round-all h250 mt20">${v}</div>`));
    
    makePageContent();

    stress("life_stress", "Life Stress", data23)

}

function reportPart3() {
    makeReportPart(3);
    makePageContainer($nPage++);

    $content.append($(`<div class="title"><img src="./images/report/no3.png" /><span>아이와 보호자 의 상호작용 관찰 평가, 분석</span></div>`));
    $content.append($(`<div class="subtitle"><span>아동에게 놀이는 정말 중요할까요?</span></div>`));
    $content.append($(`<img class="img-3-1" src="./images/report/3_1.png" >`));
    $content.append($(`<div class="subtitle"><span>왜 자유놀이 상황을 통해 상호작용관찰을 할까요?</span></div>`));
    $content.append($(`<img class="img-3-2" src="./images/report/3_2.png" >`));
    $content.append($(`<img class="img-3-3" src="./images/report/3_3.png" >`));


    makePageContent();
    
}
function reportPart4() {
    makeReportPart(4);
    makePageContainer($nPage++);

    let d1 = $('#v1141').val()
    let v1 = $('#v3111').val();

    let d2 = $('#v1142').val()
    let v2 = $('#v3121').val();
    
    $content.append($(`<div class="title"><img src="./images/report/no4.png" /><span>아이의 행동 관찰로 본 전반적인 발달상태</span></div>`));
    $content.append($(`<img class="img-4-1" src="./images/report/4_1.png" ><!--TODO DIV background로 변경해야함-->`));

    $content.append($(`<div style="margin-top:-83px"><div class="group"><span>1회차</span></div><span>${d1}</span></div>`));
    $content.append($(`<div class="desc round-right-bottom h200 mb20">${v1}</div>`));

    $content.append($(`<div class="group"><span>1회차</span></div><span>${d2}</span>`));
    $content.append($(`<div class="desc round-right-bottom h200 mb20">${v2}</div>`));

    makePageContent();
    
}
function reportPart5() {
    makeReportPart(5);
    //자녀의 상호작용 관찰 분석
    interaction(data32, 5);
}
function reportPart6() {
    makeReportPart(6);
    makePageContainer($nPage++);

    let v0 = $('#v1121').val();
    let v1 = $('#v3261').val();
    let v2 = $('#v3271').val();
    let v3 = $('#v3281').val();

    $content.append($(`<div class="title"><img src="./images/report/no6.png" /><span>아이 분석</span></div>`));
    $content.append($(`<img class="img-6-1" src="./images/report/6_1.png" >`));
    $content.append($(`<div class="subtitle" style="margin-top:-60px"><span>${v0} 아이의 강점</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v1}</div>`));
    $content.append($(`<div class="subtitle"><span>${v0} 아이의 약점</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v2}</div>`));
    $content.append($(`<div class="subtitle"><span>BJW-TIP (양육스트레스와 연결해 생각해보세요)</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v3}</div>`));

    makePageContent();
}
function reportPart7() {
    makeReportPart(7);
    interaction(data33, 7);
}
function reportPart8() {
    makeReportPart(8);
    makePageContainer($nPage++);
    
    let v0 = $('#v1121').val();
    let v1 = $('#v1112').val();
    let v2 = $('#v3361').val();
    let v3 = $('#v3371').val();
    let v4 = $('#v3381').val();
    
    $content.append($(`<div class="title"><img src="./images/report/no8.png" /><span>${v1} 분석</span></div>`));
    $content.append($(`<img class="img-8-1" src="./images/report/8_1.png" >`));
    $content.append($(`<div class="subtitle" style="margin-top:-60px"><span>${v0} ${v1}의 강점</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v2}</div>`));
    $content.append($(`<div class="subtitle"><span>${v0} ${v1}의 약점</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v3}</div>`));
    $content.append($(`<div class="subtitle"><span>BJW-TIP (양육스트레스와 연결해 생각해보세요)</span></div>`));
    $content.append($(`<div class="desc round-all h180 mb20">${v4}</div>`));

    makePageContent();
}
function reportPart9() {
    makeReportPart(9);
    
    let v0 = $('#v1112').val();
    let v1 = $('#v4111').val();
    let v2 = $('#v4112').val();
    let v3 = $('#v4121').val();
    let v4 = $('#v4122').val();
    let v5 = $('#v4131').val();
    let v6 = $('#v4132').val();
    let v7 = $('#v4141').val();
    //let v8 = $('#v4151').val();

    makePageContainer($nPage++);
    $content.append($(`<div class="title"><img src="./images/report/no9.png" /><span>아이와 ${v0}를 위한 맞춤 솔루션</span></div>`));
    $content.append($(`<img class="img-9-1" src="./images/report/9_1.png" >`));
    $content.append($(`<div class="item round" ><span>하나. ${v1}</span></div>`));
    $content.append($(`<div class="desc round-bottom h200 mb20">${v2}</div>`));
    $content.append($(`<div class="item round"><span>둘. ${v3}</span></div>`));
    $content.append($(`<div class="desc round-bottom h200 mb20">${v4}</div>`));
    $content.append($(`<div class="item round"><span>셋. ${v5}</span></div>`));
    $content.append($(`<div class="desc round-bottom h200 mb20">${v6}</div>`));
    /*
    $content.append($(`<div class="item round"><span>장점</span></div>`));
    $content.append($(`<div class="desc round-bottom h100 mb20">${v7}</div>`));
    $content.append($(`<div class="item round"><span>단점</span></div>`));
    $content.append($(`<div class="desc round-bottom h100 mb20">${v8}</div>`));
    */
    makePageContent();

    makePageContainer($nPage++);

    $content.append($(`<div class="title"><img src="./images/report/no9.png" /><span>아이와 ${v0}를 위한 맞춤 솔루션</span></div>`));
    $content.append($(`<img class="img-9-1" src="./images/report/9_1.png" >`));
    $content.append($(`<div class="desc round-all h700">${v7}</div>`));
    makePageContent();
}

// function reportPart10() {
//     makeReportPart(10);
//     makePageContainer($nPage++);
//     $content.append($(`<div class="desc round-bottom h200 mb20">마지막페이지 통이미지 필요</div>`));
//     makePageContent();
// }

function reportPart10() {
    makeReportPart(0);
    $pageContainer = $(`<div id="cover" class="page-container"></div>`);
    $page = $('<div class="page"></div>');
    let $end = $('<div class="end"></div>');

    $page.append($end);
    $pageContainer.append($page);
    $reportPart.append($pageContainer);
     
    $reportContainer.append($reportPart);
    //$reportContainer.append($pageContainer);
}

function interaction(data, partNo) {
    //자녀의 상호작용 관찰 분석
    //console.log(data32)
    let no = 1;
    // $reportPart = 	$('#report-part' + partNo);

    // let $pageContainert;
    // let $page;
    // let $top;
    // let $middle;
    // let $bottom;
    // let $content;

    let $title;
    let $group;
    let $item;
    let $desc;
    let groupNo = 1;
    let score;
    let desc;

    let v0 = $('#v1121').val().trim();
    let v1 = $('#v1112').val().trim();

    data.forEach(data => {
        //console.log(data);
        groupNo = 1;
        for (const [groupKey, group] of Object.entries(data)) {
            //console.log(`${groupKey}`); //주도성
            
            group.forEach(groupItems => {
                //console.log(items);

                if ((groupNo % 2) == 1) {
                    //페이지 추가
                    makePageContainer($nPage++);

                    // $pageContainert = $('<div class="page-container"></div>');
                    // $page = $('<div class="page"></div>');
                    // $top = $('<div class="top"></div>');
                    // $middle = $('<div class="middle"></div>');
                    // $bottom = $('<div class="bottom"></div>');
                    // $content = $('<div class="content"></div>');
                } 

                for (const [key, items] of Object.entries(groupItems)) {
                    //console.log(`${key} 0 -> ${items[0]}`); 
                    //console.log(`${key} 1 -> ${items[1]}`); 
                    //console.log(`${key} 2 -> ${items[2]}`); 
                    //console.log((groupNo % 2))
                    score = $(`:radio[name="${key}"]:checked`).val()

                    if (score == 0 || score == 1) {
                        desc = items[1];
                    } else if (score == 2 || score == 3) {
                        desc = items[2];
                    } else {
                        //desc = "해당항목을 선택하지 않으셨습니다.";
                        desc = "";
                    }
                    
                    if ((groupNo % 2) == 1) {
                        if (partNo == 5) {
                            $title = $(`<div class="title"><img src="./images/report/no${partNo}.png" /><span>${v0}의 상호작용 관찰 분석</span></div>`);
                        } else {
                            $title = $(`<div class="title"><img src="./images/report/no${partNo}.png" /><span>${v0} ${v1}의 상호작용 관찰 분석</span></div>`);
                        }
                        $group = $(`<div class="group"><span>${groupKey}</span></div>`);

                     
                        $item = $(`<div class="item round"><span>${no++}. ${items[0]}</span></div>`);
                        $desc = $(`<div class="desc">${desc.replace("☞", "<br/><br/>☞")}</div>`)

                        $content.append($title);
                        $content.append($group);
                        $content.append($item);
                        $content.append($desc);

                    } else {

                        $item = $(`<div class="item"><span>${no++}. ${items[0]}</span></div>`);
                        $desc = $(`<div class="desc round-bottom">${desc.replace("☞", "<br/><br/>☞")}</div>`)
                        $content.append($item);
                        $content.append($desc);
                    }
                    //항목추가
                    
                    //
                } //for
                groupNo++;
                if ( (groupNo % 2) == 0) {
                    makePageContent();

                    // $page.append($top);
                    // $page.append($middle);
                    // $middle.append($content);
                    // $page.append($bottom);
                    // $pageContainert.append($page);
                    // $reportPart.append($pageContainert);
                }
                
            }); //forEach

            if ( (groupNo % 2) == 0) {
                makePageContent();
                // $page.append($top);
                // $page.append($middle);
                // $middle.append($content);
                // $page.append($bottom);
                // $pageContainert.append($page);
                // $reportPart.append($pageContainert);
            }
        } //for
    }); // group
}

function stress(id, title, data) {

    let chartId = `${id}_chart`;
    let tableId = `#${id}_table`;

    let datas = [];
    data.keys.forEach(key => {
        datas.push($(`#${key}`).val().trim()==''?0:$(`#${key}`).val() * 1) ;
    } );

    let options = {
        type: "radar",
        data: {
            labels: data.labels,
            datasets: [{
                data: datas,
                fill: true,
                backgroundColor: 'rgba(54, 162, 235, 0.2)',
                borderColor: 'rgb(54, 162, 235)',
                pointBackgroundColor: 'rgb(54, 162, 235)',
                pointBorderColor: '#fff',
                pointHoverBackgroundColor: '#fff',
                pointHoverBorderColor: 'rgb(54, 162, 235)'
            }]
        },
        options: {
            legend: {display: false},
            scale: {
                gridLines: {
                    color: '#AAA'
                },
                ticks: {
                    beginAtZero: false,
                    max: 100,
                    min: 0,
                    stepSize: 20,
                    //fontColor: '#fff',
                    fontColor: '#444'
                    //backdropColor: '#444'
                },
                pointLabels: {
                    fontSize: 17,
                    fontColor: '#000'
                }
            }
        }
    }

    let ctx = document.getElementById(chartId).getContext('2d');
    new Chart(ctx, options);

    //append table
    let $Table = $('<table/>');
    $Table.append('<colgroup><col width="18%"/><col width="8%"/><col width="64%"/><col width="10%"/></colgroup>');
    $Table.append('<tbody>');
    $Table.append('<tr><th>항목</th><th nowrap>표준점수</th><th>설명</th><th>단계</th></tr>');
    let i;
    for(i = 0 ;i < data.labels.length - 1; i++) {
        $Table.append('<tr><td>' + data.labels[i] + '</td><td class="red">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="red">' + getGrade(datas[i] ) + '</td></tr>');	
    }
    //if (id != "life_stress") {
        $Table.append('<tr class="avg"><td class="black">' + data.labels[i] + '</td><td class="black">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="black">' + getGrade(datas[i] ) + '</td></tr>');	
    //} else {
    //    $Table.append('<tr><td>' + data.labels[i] + '</td><td class="red">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="red">' + getGrade(datas[i] ) + '</td></tr>');	
    //}
 
    $Table.append('</tbody>');
    $(tableId).append($Table);
}

function stress2(id, title, data) {

    let chartId = `${id}_chart`;
    let tableId = `#${id}_table`;

    let datas = [];
    data.keys.forEach(key => {
        datas.push($(`#${key}`).val().trim()==''?0:$(`#${key}`).val() * 1) ;
    } );
debugger;
    let ctx = document.getElementById(chartId).getContext('2d');

    new Chart(chartId, {
        type: "radar",
        data: {
            labels: data.labels,
            datasets: [{
                //backgroundColor: data.colors,
                data: datas,

                label: 'Stress',
                //fill: true,
                //backgroundColor: 'rgba(255, 99, 132, 0.2)',
                //borderColor: 'rgb(255, 99, 132)',
                //pointBackgroundColor: 'rgb(255, 99, 132)',
                //pointBorderColor: '#fff',
                //pointHoverBackgroundColor: '#fff',
                //pointHoverBorderColor: 'rgb(255, 99, 132)'
                borderWidth: 1
            }]
        },
        options: {
            legend: {display: false},
            scales: {
                r: {
                    //suggestedMin: 0,
                    //suggestedMax: 100,
                    pointLabels: {
                      font: {
                        size: 24
                      }
                    }
                }
                
            }
        }
        /*
        options: {
            legend: {display: false},
            title: {display: false,	text: title},
            
            scales: {
                yAxes: [{
                        display: true,
                        ticks: {
                            fontSize : 14,
                        }
                    }],
                xAxes: [{
                        display: true,
                        ticks: {
                            beginAtZero: true,
                            steps: 10,
                            stepValue: 5,
                            max: 100,
                            fontSize : 14,
                        }
                    }]
            }
           
        }
        */
    });

    //append table
    let $Table = $('<table/>');
    $Table.append('<colgroup><col width="18%"/><col width="8%"/><col width="64%"/><col width="10%"/></colgroup>');
    $Table.append('<tbody>');
    $Table.append('<tr><th>항목</th><th nowrap>표준점수</th><th>설명</th><th>단계</th></tr>');
    let i;
    for(i = 0 ;i < data.labels.length - 1; i++) {
        $Table.append('<tr><td>' + data.labels[i] + '</td><td class="red">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="red">' + getGrade(datas[i] ) + '</td></tr>');	
    }
    if (id != "life_stress") {
        $Table.append('<tr class="avg"><td class="black">' + data.labels[i] + '</td><td class="black">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="black">' + getGrade(datas[i] ) + '</td></tr>');	
    } else {
        $Table.append('<tr><td>' + data.labels[i] + '</td><td class="red">' + datas[i] + '</td><td class="left">' + data.descs[i] + '</td><td class="red">' + getGrade(datas[i] ) + '</td></tr>');	
    }
 
    $Table.append('</tbody>');
    $(tableId).append($Table);
}

function getGrade(score){
    if (score >= 90) return '매우높음';
    if (score >= 85) return '높음';
    if (score >= 70) return '보통';
    if (score >= 60) return '낮음';
    return '매우낮음';
};

async function HTML2PDF() {
    startProgress();
    window.jsPDF = window.jspdf.jsPDF;
    //let doc = new jsPDF('p', 'mm', 'a4'); //jspdf객체 생성
    let doc = new jsPDF('p', 'pt', 'a4'); //jspdf객체 생성
    let $el = $('.page');
    let totalPage = $el.length;
    for (let i = 0;i < totalPage; i++) {
        await html2canvas($el[i],{
            allowTaint: true,
        }).then(function(canvas) {
            //let imgData = canvas.toDataURL('image/png'); //캔버스를 default quality(0.91)이미지로 변환
            let imgData = canvas.toDataURL('image/png', 1.0); //캔버스를 high quality(1.0) 이미지로 변환
            console.log(imgData);
            if (i == 0) {
                doc.addImage(imgData, 'PNG', 27.64, 39.09, 540.000, 763.710); //이미지를 기반으로 pdf생성, 여백추가
            } else {
                doc.addPage();
                //debugger;
                showProgressBar(totalPage, i);
                //$('#page-no').text(i);
                //doc.addImage(imgData, 'PNG', 0,0);//, 13.82, 39.09, 567.640, 802.800); //이미지를 기반으로 pdf생성, 여백추가
                doc.addImage(imgData, 'PNG', 0, 0, 595.28, 841.89); //이미지를 기반으로 pdf생성
            }
        });
    }
    // let img = new Image();
    // img.src = './images/report/cover.jpg'
    // doc.addPage();
    // doc.addImage(img, 'JPG', 0, 0, 595.28, 841.89);
    //홍판서 의 자녀 홍길동  상호작용 심리평가 보고서_20210901061515
    
    let date = new Date().toISOString().slice(0, 19).replace(/-|:/g, '');
    

    //doc.save(`${$('#v1121').val()}의 ${$('#v1112').val()} ${$('#v1111').val()}와의 상호작용 심리평가 보고서_${date}.pdf`); //pdf저장
    let pdf = `${$('#v1121').val()}의 심리평가 보고서_${date}.pdf`;
    doc.save(pdf); //pdf저장
    initProgress();
};



function showProgressBar(totalPage, page) {
    let progressRate = page / totalPage * 100;
   $('#progressbar').val(progressRate.toFixed(0))
};

function startProgress() {
    $('#progressbar').val(0);
    $('#progressbar').show();
    $('.print-pdf').hide();
    $('.close').hide();
}

function initProgress() {
    $('#progressbar').hide();
    $('.print-pdf').show();
    $('.close').show();
}

